-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Oct 01, 2021 at 09:03 PM
-- Server version: 10.4.21-MariaDB
-- PHP Version: 7.3.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `test`
--

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password`) VALUES
(1, 'GODUSER', '6e3d204c4ec9a97cc39b6876f492a864');

-- --------------------------------------------------------

--
-- Table structure for table `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2009`
--

CREATE TABLE `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2009` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `category` varchar(255) NOT NULL,
  `ects` varchar(255) NOT NULL,
  `correspondence` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2009`
--

INSERT INTO `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2009` (`id`, `name`, `category`, `ects`, `correspondence`) VALUES
(1, 'Εισαγωγή στην Επιστήμη και Τεχνολογία της Πληροφορικής και των\r\nΤηλεπικοινωνιών', 'Κ', '6', 'Εισαγωγή στην Πληροφορική και τις Τηλεπικοινωνίες'),
(2, 'Εισαγωγή στον Προγραμματισμό', 'Κ', '6', 'Προγραμματισμός Ι'),
(3, 'Λογική Σχεδίαση', 'Κ', '6', 'Λογική Σχεδίαση'),
(4, 'Ηλεκτρονική', 'Κ', '6', 'Ηλεκτρονική'),
(5, 'Δομές Δεδομένων', 'Κ', '6', 'Προγραμματισμός ΙΙ ή Δομές Δεδομένων'),
(6, 'Σήματα και Συστήματα', 'Κ', '6', 'Σήματα και συστήματα'),
(7, 'Δίκτυα Επικοινωνιών Ι', 'Κ', '6', 'Δίκτυα Επικοινωνιών Ι'),
(8, 'Επικοινωνίες Ι', 'Κ', '6', 'Αρχές Τηλεπικοινωνιακών Συστημάτων'),
(9, 'Γραμμικά Ηλεκτρικά Κυκλώματα', 'Κ', '6', 'Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(10, 'Θεωρία Πληροφορίας και Κωδίκων', 'Κ', '6', 'Εισαγωγή στη θεωρία πληροφορίας και κωδίκων'),
(11, 'Λειτουργικά Συστήματα - Προγραμ/σμός Συστήματος', 'Κ', '6', 'Αντικειμενοστρεφής Προγραμματισμός ή Λειτουργικά Συστήματα'),
(12, 'Πεδία και Κύματα στις Επικοινωνίες', 'Κ', '6', 'Ηλεκτρομαγνητικά Πεδία'),
(13, 'Οπτικές Επικοινωνίες ή Οπτικά Συστήματα Επικοινωνιών', 'Κ', '6', 'Εισαγωγή στις Οπτικές Επικοινωνίες'),
(14, 'Ασύρματες και Κινητές Επικοινωνίες', 'Κ', '6', 'Ασύρματες και Κινητές Επικοινωνίες Ι ή Ασύρματες και Κινητές Επικοινωνίες ΙΙ'),
(15, 'Ψηφιακή Επεξεργασία Σήματος', 'Κ', '6', 'Ψηφιακή Επεξεργασία Σήματος'),
(16, 'Δίκτυα Επικοινωνιών ΙΙ', 'Κ', '6', 'Δίκτυα Επικοινωνιών ΙΙ'),
(17, 'Επικοινωνίες ΙΙ', 'Κ', '6', 'Ψηφιακές Επικοινωνίες'),
(18, 'Ακαδημαϊκά Αγγλικά - Αγγλική Ορολογία Επιστήμης και Τεχνολογίας Επικοινωνιών', 'Κ', '6', 'Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(19, 'Φυσική Ι', 'Κ', '6', 'Φυσική ή Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(20, 'Φυσική ΙΙ', 'Κ', '6', 'Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(21, 'Μαθηματικά Ι (παλαιό)', 'Κ', '6', 'Μαθηματικά Ι'),
(22, 'Μαθηματικά ΙΙ (παλαιό)', 'Κ', '6', 'Μαθηματικά ΙΙ ή Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(23, 'Γραμμική Άλγεβρα', 'Κ', '6', 'Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(24, 'Πιθανότητες και Στατιστική', 'Κ', '6', 'Πιθανότητες και Στατιστική'),
(25, 'Διαφορικές Εξισώσεις', 'Κ', '6', 'Μαθηματικά ΙΙΙ ή Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(26, 'Αριθμητική Ανάλυση', 'Κ', '6', 'Αριθμητική Ανάλυση ή Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή\r\nΕΚ-Τ'),
(27, 'Πτυχιακή Εργασία', 'Κ', '6', 'Πτυχιακή Εργασία'),
(28, 'Αναγνώριση Προτύπων και Ανάλυση Εικόνας', 'ΕΚ-ΠΤ', '5', ''),
(29, 'Προχωρημένα Θέματα Θεωρίας κωδικών', 'ΕΚ-ΠΤ', '5', ''),
(30, 'Επεξεργασία - Αναγνώριση Ομιλίας', 'ΕΚ-Τ', '5', ''),
(31, 'Στοχαστική επεξεργασία σήματος και εφαρμογές', 'ΕΚ-Τ', '5', ''),
(32, 'Προσαρμοστικά Συστήματα στις Τηλεπικοινωνίες ', 'ΕΚ-Τ', '5', ''),
(33, 'Συμπίεση και Μετάδοση Πολυμέσων', 'ΕΚ-Τ', '5', ''),
(34, 'Επεξεργασία Εικόνας ', 'ΕΚ-ΠΤ', '5', ''),
(35, 'Μοντελοποίηση - Ταυτοποίηση - Εξίσωση Τηλεπικοινωνιακών Διαύλων', 'ΕΚ-Τ', '5', ''),
(36, 'Επεξεργαστές Ψηφιακών Σημάτων', 'ΕΚ-Τ', '5', ''),
(37, 'Ειδικά Θέματα Επεξεργασίας Σήματος ', 'ΕΚ-Τ', '5', ''),
(38, 'Θεωρία και Τεχνολογία Κεραιών', 'ΕΚ-Τ', '5', ''),
(39, 'Οπτοηλεκτρονική', 'ΕΚ-Τ', '5', ''),
(40, 'Εφαρμογές συστημάτων και δικτύων οπτικών ινών', 'ΕΚ-Τ', '5', ''),
(41, 'Μικροκύματα και κυματοδηγοί', 'ΕΚ-Τ', '5', ''),
(42, 'Ασύρματες ζεύξεις', 'ΕΚ-Τ', '5', ''),
(43, 'Σύγχρονα κυψελωτά συστήματα επικοινωνιών', 'ΕΚ-Τ', '5', ''),
(44, 'Σύγχρόνα εντοπισμού & Ραντάρ', 'ΕΚ-Τ', '5', ''),
(45, 'Δορυφορικές επικοινωνίες', 'ΕΚ-Τ', '5', ''),
(46, 'Σχεδίαση Συστημάτων Μετάδοσης Ενσύρματων Δικτύων', 'ΕΚ-Τ', '5', ''),
(47, 'Ειδικά Θέματα Τεχνολογίας Συστημάτων Επικοινωνίας ', 'ΕΚ-Τ', '5', ''),
(48, 'Αντικειμενοστραφής Προγραμματισμός ', 'ΕΚ-ΠΤ ', '5', ''),
(49, 'Στοχαστικά μοντέλα δικτύων και ανάλυση απόδοσης', 'ΕΚ-ΠΤ', '5', ''),
(50, 'Προγραμματισμός κατανεμημένων συστημάτων', 'ΕΚ-ΠΤ', '5', ''),
(51, 'Σχεδίαση εφαρμογών και υπηρεσιών διαδικτύου ', 'ΕΚ-ΠΤ', '5', ''),
(52, 'Διαχείριση και Ασφάλεια Δικτύων', 'ΕΚ-ΠΤ', '5', ''),
(53, 'Σχεδίαση πρωτοκόλλων επικοινωνίας ', 'ΕΚ-ΠΤ', '5', ''),
(54, 'Βάσεις Δεδομένων', 'ΕΚ-ΠΤ', '5', ''),
(55, 'Υλοποίηση Δικτυακών Υποδομών και Υπηρεσιών', 'ΕΚ-Τ', '5', ''),
(56, 'Τεχνικές προσομοίωσης δικτύων επικοινωνιών', 'ΕΚ-ΠΤ', '5', ''),
(57, 'Ειδικά Θέματα Δικτύων Επικοινωνιών, Υπηρεσιών και Εφαρμογών', 'ΕΚ-ΠΤ', '5', ''),
(58, 'Δίκτυα Πρόσβασης Ευρείας Ζώνης', 'ΕΚ-Τ', '5', ''),
(59, 'Αρχιτεκτονική Υπολογιστών Ι ', 'ΕΚ-ΠΤ', '5', ''),
(60, 'Θεωρία παιγνίων', 'ΕΕ', '4', ''),
(61, 'Διακριτά Μαθηματικά', 'ΕΚ-Π', '5', ''),
(62, 'Θεωρία Υπολογισμού ', 'ΕΚ-Π', '5', ''),
(63, 'Αλγόριθμοι και Πολυπλοκότητα', 'ΕΚ-Π', '5', ''),
(64, 'Τηλεφωνικά δίκτυα', 'ΕΚ-Τ', '5', ''),
(65, 'Υπολογιστικές Τεχνικές και Σχεδίαση Συστημάτων Ασύρματης Μετάδοσης', 'ΕΚ-Τ', '5', ''),
(66, 'Σχεδίαση VLSI Κυκλωμάτων', 'ΕΚ-ΠΤ', '5', ''),
(67, 'Προστασία και Επιβιωσιμότητα', 'ΕΚ-Τ', '5', ''),
(68, 'Αρχιτεκτονική μεταγωγέων και δρομολογητών ', 'ΕΚ-ΠΤ', '5', ''),
(69, 'Επίπεδο Ελέγχου Δικτύου - Αρχιτεκτονικές Κατανομής Πόρων σε Δίκτυα Υψηλών Ταχυτήτων', 'ΕΚ-Τ', '5', ''),
(70, 'Προγραμματισμός για Ασύρματα Διαδίκτυα και Κινητές Επιχειρήσεις (m-business)', 'ΕΚ-ΠΤ', '5', ''),
(71, 'Προγραμματισμός Ιστοσελίδων (Web Design) ', 'ΕΚ-ΠΤ', '5', ''),
(72, 'Κρυπτολογία (Κρυπτογραφία - Κρυπτανάλυση)', 'ΕΚ-Π', '5', ''),
(73, 'Ηλεκτρονικά Τηλεπικοινωνιακά Συστήματα', 'ΕΚ-Τ', '5', ''),
(74, 'Σύγχρονες Τάσεις και Νομικά Θέματα στις Τηλεπικοινωνίες', 'ΕΕ', '4', ''),
(75, 'Οικονομικά και Επιχειρηματικά Θέματα στις Τηλεπικοινωνίες', 'ΕΕ', '4', ''),
(76, 'Εισαγωγή στην Οικονομική Επιστήμη ΙΙ ', 'ΕΕ', '4', ''),
(77, 'Εισαγωγή στην Οικονομική Επιστήμη Ι', 'ΕΕ', '4', ''),
(78, 'Γενικά Αγγλικά', 'ΕΕ', '4', ''),
(79, 'Γενικά Γαλλικά και Ορολογία ', 'ΕΕ', '4', ''),
(80, 'Φιλοσοφία και Ποίηση ', 'ΕΕ', '4', ''),
(81, 'Παιδαγωγικά', 'ΕΕ-Π', '5', ''),
(82, 'Κοινωνιολογία', 'ΕΕ', '4', ''),
(83, 'Ψυχολογία', 'ΕΕ', '5', ''),
(84, 'Πρακτική άσκηση', 'ΕΕ', '3', ''),
(85, 'Επιχειρηματικότητα και Διοίκηση Επιχειρήσεων', 'ΕΕ', '4', ''),
(86, 'Ανάπτυξη Νέων Προϊόντων και Υπηρεσιών', 'ΕΕ', '4', '');

-- --------------------------------------------------------

--
-- Table structure for table `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2009_2010`
--

CREATE TABLE `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2009_2010` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `category` varchar(255) NOT NULL,
  `ects` varchar(255) NOT NULL,
  `correspondence` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2009_2010`
--

INSERT INTO `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2009_2010` (`id`, `name`, `category`, `ects`, `correspondence`) VALUES
(1, 'Εισαγωγή στις Οπτικές Επικοινωνίες ή Οπτικά Συστήματα Επικοινωνιών', 'Κ', '6', 'Εισαγωγή στις Οπτικές Επικοινωνίες'),
(2, 'Ασύρματες και Κινητές Επικοινωνίες Ι', 'Κ', '6', 'Ασύρματες και Κινητές Επικοινωνίες Ι\r\n'),
(3, 'Ασύρματες και Κινητές Επικοινωνίες ΙΙ', 'Κ', '6', 'Ασύρματες και Κινητές Επικοινωνίες ΙΙ ή Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(4, 'Ψηφιακή Επεξεργασία Σήματος', 'Κ', '6', 'Ψηφιακή Επεξεργασία Σήματος'),
(5, 'Δίκτυα Επικοινωνιών ΙΙ', 'Κ', '6', 'Δίκτυα Επικοινωνιών ΙΙ'),
(6, 'Επικοινωνίες ΙΙ', 'Κ', '6', 'Ψηφιακές Επικοινωνίες'),
(7, 'Ακαδημαϊκά Αγγλικά - Αγγλική Ορολογία Επιστήμης και Τεχνολογίας Επικοινωνιών', 'Κ', '6', 'Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(8, 'Φυσική Ι', 'Κ', '6', 'Φυσική ή Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ\r\n'),
(9, 'Φυσική ΙΙ', 'Κ', '6', 'Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(10, 'Μαθηματικά Ι (παλαιό)', 'Κ', '6', 'Μαθηματικά Ι '),
(11, 'Μαθηματικά ΙΙ (παλαιό)', 'Κ', '6', 'Μαθηματικά ΙΙ ή Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ\r\n'),
(12, 'Γραμμική Άλγεβρα', 'Κ', '6', 'Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(13, 'Πιθανότητες και Στατιστική', 'Κ', '6', 'Πιθανότητες και Στατιστική'),
(14, 'Διαφορικές Εξισώσεις', 'Κ', '6', 'Μαθηματικά ΙΙΙ ή Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(15, 'Αριθμητική Ανάλυση', 'Κ', '6', 'Αριθμητική Ανάλυση ή Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή\r\nΕΚ-Τ'),
(16, 'Πτυχιακή Εργασία', 'Κ', '30', 'Πτυχιακή Εργασία'),
(29, 'Εισαγωγή στην Επιστήμη και Τεχνολογία της Πληροφορικής και των\r\nΤηλεπικοινωνιών', 'Κ', '6', 'Εισαγωγή στην Πληροφορική και τις Τηλεπικοινωνίες'),
(30, 'Εισαγωγή στον Προγραμματισμό', 'Κ', '6', 'Προγραμματισμός Ι'),
(31, 'Λογική Σχεδίαση', 'Κ', '6', 'Λογική Σχεδίαση'),
(32, 'Ηλεκτρονική', 'Κ', '6', 'Ηλεκτρονική'),
(33, 'Δομές Δεδομένων', 'Κ', '6', 'Προγραμματισμός ΙΙ ή Δομές Δεδομένων'),
(34, 'Σήματα και Συστήματα', 'Κ', '6', 'Σήματα και Συστήματα'),
(35, 'Δίκτυα Επικοινωνιών Ι', 'Κ', '6', 'Δίκτυα Επικοινωνιών Ι'),
(36, 'Επικοινωνίες Ι', 'Κ', '6', 'Αρχές Τηλεπικοινωνιακών Συστημάτων'),
(37, 'Γραμμικά Ηλεκτρικά Κυκλώματα', 'Κ', '6', 'Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(38, 'Θεωρία Πληροφορίας και Κωδίκων', 'Κ', '6', 'Εισαγωγή στη θεωρία πληροφορίας και κωδίκων'),
(39, 'Λειτουργικά Συστήματα - Προγραμ/σμός Συστήματος', 'Κ', '6', 'Αντικειμενοστρεφής Προγραμματισμός ή Λειτουργικά Συστήμα- τα'),
(40, 'Πεδία και Κύματα στις Επικοινωνίες', 'Κ', '6', 'Ηλεκτρομαγνητικά Πεδία'),
(41, 'Αναγνώριση Προτύπων και Ανάλυση Εικόνας', 'ΕΚ-ΠΤ', '5', ''),
(42, 'Προχωρημένα θέματα θεωρίας κωδίκων', 'ΕΚ-ΠΤ', '5', ''),
(43, 'Επεξεργασία - Αναγνώριση Ομιλίας', 'ΕΚ-Τ', '5', ''),
(44, 'Στοχαστική επεξεργασία σήματος και εφαρμογές', 'ΕΚ-Τ', '5', ''),
(45, 'Προσαρμοστικά Συστήματα στις Τηλεπικοινωνίες ', 'ΕΚ-Τ', '5', ''),
(46, 'Συμπίεση και Μετάδοση Πολυμέσων', 'ΕΚ-Τ', '5', ''),
(47, 'Επεξεργασία Εικόνας ', 'ΕΚ-ΠΤ', '5', ''),
(48, 'Μοντελοποίηση - Ταυτοποίηση - Εξίσωση Τηλεπικοινωνιακών Διαύλων', 'ΕΚ-Τ', '5', ''),
(49, 'Επεξεργαστές Ψηφιακών Σημάτων', 'ΕΚ-Τ', '5', ''),
(50, 'Ειδικά Θέματα Επεξεργασίας Σήματος ', 'ΕΚ-Τ', '5', ''),
(51, 'Θεωρία και Τεχνολογία Κεραιών', 'ΕΚ-Τ', '5', ''),
(52, 'Οπτοηλεκτρονική', 'ΕΚ-Τ', '5', ''),
(53, 'Εφαρμογές συστημάτων και δικτύων οπτικών ινών', 'ΕΚ-Τ', '5', ''),
(54, 'Μικροκύματα και κυματοδηγοί', 'ΕΚ-Τ', '5', ''),
(55, 'Ασύρματες ζεύξεις', 'ΕΚ-Τ', '5', ''),
(56, 'Σύγχρονα κυψελωτά συστήματα επικοινωνιών', 'ΕΚ-Τ', '5', ''),
(57, 'Σύγχρόνα εντοπισμού & Ραντάρ', 'ΕΚ-Τ', '5', ''),
(58, 'Δορυφορικές επικοινωνίες', 'ΕΚ-Τ', '5', ''),
(59, 'Σχεδίαση Συστημάτων Μετάδοσης Ενσύρματων Δικτύων', 'ΕΚ-Τ', '5', ''),
(60, 'Ειδικά Θέματα Τεχνολογίας Συστημάτων Επικοινωνίας ', 'ΕΚ-Τ', '5', ''),
(61, 'Αντικειμενοστραφής Προγραμματισμός ', 'ΕΚ-ΠΤ ', '5', ''),
(62, 'Στοχαστικά μοντέλα δικτύων και ανάλυση απόδοσης', 'ΕΚ-ΠΤ', '5', ''),
(63, 'Προγραμματισμός κατανεμημένων συστημάτων', 'ΕΚ-ΠΤ', '5', ''),
(64, 'Σχεδίαση εφαρμογών και υπηρεσιών διαδικτύου ', 'ΕΚ-ΠΤ', '5', ''),
(65, 'Διαχείριση και Ασφάλεια Δικτύων', 'ΕΚ-ΠΤ', '5', ''),
(66, 'Σχεδίαση πρωτοκόλλων επικοινωνίας ', 'ΕΚ-ΠΤ', '5', ''),
(67, 'Βάσεις Δεδομένων', 'ΕΚ-ΠΤ', '5', ''),
(68, 'Υλοποίηση Δικτυακών Υποδομών και Υπηρεσιών', 'ΕΚ-Τ', '5', ''),
(69, 'Τεχνικές προσομοίωσης δικτύων επικοινωνιών', 'ΕΚ-ΠΤ', '5', ''),
(70, 'Ειδικά Θέματα Δικτύων Επικοινωνιών, Υπηρεσιών και Εφαρμογών', 'ΕΚ-ΠΤ', '5', ''),
(71, 'Δίκτυα Πρόσβασης Ευρείας Ζώνης', 'ΕΚ-Τ', '5', ''),
(72, 'Αρχιτεκτονική Υπολογιστών Ι ', 'ΕΚ-ΠΤ', '5', ''),
(73, 'Θεωρία παιγνίων', 'ΕΕ', '4', ''),
(74, 'Διακριτά Μαθηματικά', 'ΕΚ-Π', '5', ''),
(75, 'Θεωρία Υπολογισμού ', 'ΕΚ-Π', '5', ''),
(76, 'Αλγόριθμοι και Πολυπλοκότητα', 'ΕΚ-Π', '5', ''),
(77, 'Τηλεφωνικά δίκτυα', 'ΕΚ-Τ', '5', ''),
(78, 'Υπολογιστικές Τεχνικές και Σχεδίαση Συστημάτων Ασύρματης Μετάδοσης', 'ΕΚ-Τ', '5', ''),
(79, 'Σχεδίαση VLSI Κυκλωμάτων', 'ΕΚ-ΠΤ', '5', ''),
(80, 'Προστασία και Επιβιωσιμότητα', 'ΕΚ-Τ', '5', ''),
(81, 'Αρχιτεκτονική μεταγωγέων και δρομολογητών ', 'ΕΚ-ΠΤ', '5', ''),
(82, 'Επίπεδο Ελέγχου Δικτύου - Αρχιτεκτονικές Κατανομής Πόρων σε Δίκτυα Υψηλών Ταχυτήτων', 'ΕΚ-Τ', '5', ''),
(83, 'Προγραμματισμός για Ασύρματα Διαδίκτυα και Κινητές Επιχειρήσεις (m-business)', 'ΕΚ-ΠΤ', '5', ''),
(84, 'Προγραμματισμός Ιστοσελίδων (Web Design) ', 'ΕΚ-ΠΤ', '5', ''),
(85, 'Κρυπτολογία (Κρυπτογραφία - Κρυπτανάλυση)', 'ΕΚ-Π', '5', ''),
(86, 'Ηλεκτρονικά Τηλεπικοινωνιακά Συστήματα', 'ΕΚ-Τ', '5', ''),
(87, 'Σύγχρονες Τάσεις και Νομικά Θέματα στις Τηλεπικοινωνίες', 'ΕΕ', '4', ''),
(88, 'Οικονομικά και Επιχειρηματικά Θέματα στις Τηλεπικοινωνίες', 'ΕΕ', '4', ''),
(89, 'Εισαγωγή στην Οικονομική Επιστήμη ΙΙ ', 'ΕΕ', '4', ''),
(90, 'Εισαγωγή στην Οικονομική Επιστήμη Ι', 'ΕΕ', '4', ''),
(91, 'Γενικά Αγγλικά', 'ΕΕ', '4', ''),
(92, 'Γενικά Γαλλικά και Ορολογία ', 'ΕΕ', '4', ''),
(93, 'Φιλοσοφία και Ποίηση ', 'ΕΕ', '4', ''),
(94, 'Παιδαγωγικά', 'ΕΕ-Π', '5', ''),
(95, 'Κοινωνιολογία', 'ΕΕ', '4', ''),
(96, 'Ψυχολογία', 'ΕΕ', '5', ''),
(97, 'Πρακτική άσκηση', 'ΕΕ', '3', ''),
(98, 'Επιχειρηματικότητα και Διοίκηση Επιχειρήσεων', 'ΕΕ', '4', ''),
(218, 'Ανάπτυξη Νέων Προϊόντων και Υπηρεσιών', 'ΕΕ', '4', '');

-- --------------------------------------------------------

--
-- Table structure for table `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2011`
--

CREATE TABLE `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2011` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `category` varchar(255) NOT NULL,
  `ects` varchar(255) NOT NULL,
  `correspondence` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2011`
--

INSERT INTO `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2011` (`id`, `name`, `category`, `ects`, `correspondence`) VALUES
(1, 'Εισαγωγή στην Επιστήμη και Τεχνολογία της Πληροφορικής και των\r\nΤηλεπικοινωνιών', 'Κ', '6', 'Εισαγωγή στην Πληροφορική και Τηλεπικοινωνίες'),
(2, 'Εισαγωγή στον Προγραμματισμό', 'Κ', '6', ' Προγραμματισμός Ι'),
(3, 'Λογική Σχεδίαση', 'Κ', '6', 'Λογική Σχεδίαση'),
(4, 'Ηλεκτρονική', 'Κ', '6', 'Ηλεκτρονική'),
(5, 'Δομές Δεδομένων', 'Κ', '6', 'Προγραμματισμός ΙΙ ή Δομές Δεδομένων'),
(6, 'Σήματα και Συστήματα', 'Κ', '6', 'Σήματα και Συστήματα'),
(7, 'Δίκτυα Επικοινωνιών Ι', 'Κ', '6', 'Δίκτυα Επικοινωνιών Ι'),
(8, 'Επικοινωνίες Ι', 'Κ', '6', 'Αρχές Τηλεπικοινωνιακών Συστημάτων'),
(9, 'Γραμμικά Ηλεκτρικά Κυκλώματα', 'Κ', '6', 'Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(10, 'Θεωρία Πληροφορίας και Κωδίκων', 'Κ', '6', 'Εισαγωγή στη θεωρία πληροφορίας και κωδίκων'),
(11, 'Λειτουργικά Συστήματα - Προγραμ/σμός Συστήματος', 'Κ', '6', 'Αντικειμενοστρεφής Προγραμματισμός ή Λειτουργικά Συστήματα'),
(12, 'Πεδία και Κύματα στις Επικοινωνίες', 'Κ', '6', 'Ηλεκτρομαγνητικά Πεδία'),
(13, 'Εισαγωγή στις Οπτικές Επικοινωνίες', 'Κ', '6', 'Εισαγωγή στις Οπτικές Επικοινωνίες'),
(14, 'Ασύρματες και Κινητές Επικοινωνίες Ι', 'Κ', '6', 'Ασύρματες και Κινητές Επικοινωνίες Ι'),
(15, 'Ασύρματες και Κινητές Επικοινωνίες ΙΙ', 'Κ', '6', 'Ασύρματες και Κινητές Επικοινωνίες ΙΙ ή Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(16, 'Ψηφιακή Επεξεργασία Σήματος', 'Κ', '6', 'Ψηφιακή Επεξεργασία Σήματος'),
(17, 'Δίκτυα Επικοινωνιών ΙΙ', 'Κ', '6', 'Δίκτυα Επικοινωνιών ΙΙ'),
(18, 'Επικοινωνίες ΙΙ', 'Κ', '6', 'Ψηφιακές επικοινωνίες'),
(19, 'Ακαδημαϊκά Αγγλικά - Αγγλική Ορολογία Επιστήμης και Τεχνολογίας Επικοινωνιών', 'Κ', '6', 'Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(20, 'Φυσική', 'Κ', '6', 'Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(21, 'Μαθηματικά Ι', 'Κ', '6', 'Μαθηματικά Ι'),
(22, 'Μαθηματικά ΙΙ', 'Κ', '6', 'Μαθηματικά ΙΙI ή Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(23, 'Πιθανότητες και Στατιστική', 'Κ', '6', 'Πιθανότητες και Στατιστική'),
(24, 'Πτυχιακή Εργασία', 'Κ', '30', 'Πτυχιακή Εργασία'),
(25, 'Αναγνώριση Προτύπων και Ανάλυση Εικόνας', 'ΕΚ-ΠΤ', '5', ''),
(26, 'Προχωρημένα θέματα θεωρίας κωδίκων', 'ΕΚ-ΠΤ', '5', ''),
(27, 'Επεξεργασία - Αναγνώριση Ομιλίας', 'ΕΚ-Τ', '5', ''),
(28, 'Στοχαστική επεξεργασία σήματος και εφαρμογές', 'ΕΚ-Τ', '5', ''),
(29, 'Προσαρμοστικά Συστήματα στις Τηλεπικοινωνίες ', 'ΕΚ-Τ', '5', ''),
(30, 'Συμπίεση και Μετάδοση Πολυμέσων', 'ΕΚ-Τ', '5', ''),
(31, 'Επεξεργασία Εικόνας ', 'ΕΚ-ΠΤ', '5', ''),
(32, 'Μοντελοποίηση - Ταυτοποίηση - Εξίσωση Τηλεπικοινωνιακών Διαύλων', 'ΕΚ-Τ', '5', ''),
(33, 'Επεξεργαστές Ψηφιακών Σημάτων', 'ΕΚ-Τ', '5', ''),
(34, 'Ειδικά Θέματα Επεξεργασίας Σήματος ', 'ΕΚ-Τ', '5', ''),
(35, 'Θεωρία και Τεχνολογία Κεραιών', 'ΕΚ-Τ', '5', ''),
(36, 'Οπτοηλεκτρονική', 'ΕΚ-Τ', '5', ''),
(37, 'Εφαρμογές συστημάτων και δικτύων οπτικών ινών', 'ΕΚ-Τ', '5', ''),
(38, 'Μικροκύματα και κυματοδηγοί', 'ΕΚ-Τ', '5', ''),
(39, 'Ασύρματες ζεύξεις', 'ΕΚ-Τ', '5', ''),
(40, 'Σύγχρονα κυψελωτά συστήματα επικοινωνιών', 'ΕΚ-Τ', '5', ''),
(41, 'Σύγχρόνα εντοπισμού & Ραντάρ', 'ΕΚ-Τ', '5', ''),
(42, 'Δορυφορικές επικοινωνίες', 'ΕΚ-Τ', '5', ''),
(43, 'Σχεδίαση Συστημάτων Μετάδοσης Ενσύρματων Δικτύων', 'ΕΚ-Τ', '5', ''),
(44, 'Ειδικά Θέματα Τεχνολογίας Συστημάτων Επικοινωνίας ', 'ΕΚ-Τ', '5', ''),
(45, 'Αντικειμενοστραφής Προγραμματισμός ', 'ΕΚ-ΠΤ ', '5', ''),
(46, 'Στοχαστικά μοντέλα δικτύων και ανάλυση απόδοσης', 'ΕΚ-ΠΤ', '5', ''),
(47, 'Προγραμματισμός κατανεμημένων συστημάτων', 'ΕΚ-ΠΤ', '5', ''),
(48, 'Σχεδίαση εφαρμογών και υπηρεσιών διαδικτύου ', 'ΕΚ-ΠΤ', '5', ''),
(49, 'Διαχείριση και Ασφάλεια Δικτύων', 'ΕΚ-ΠΤ', '5', ''),
(50, 'Σχεδίαση πρωτοκόλλων επικοινωνίας ', 'ΕΚ-ΠΤ', '5', ''),
(51, 'Βάσεις Δεδομένων', 'ΕΚ-ΠΤ', '5', ''),
(52, 'Υλοποίηση Δικτυακών Υποδομών και Υπηρεσιών', 'ΕΚ-Τ', '5', ''),
(53, 'Τεχνικές προσομοίωσης δικτύων επικοινωνιών', 'ΕΚ-ΠΤ', '5', ''),
(54, 'Ειδικά Θέματα Δικτύων Επικοινωνιών, Υπηρεσιών και Εφαρμογών', 'ΕΚ-ΠΤ', '5', ''),
(55, 'Δίκτυα Πρόσβασης Ευρείας Ζώνης', 'ΕΚ-Τ', '5', ''),
(56, 'Αρχιτεκτονική Υπολογιστών Ι ', 'ΕΚ-ΠΤ', '5', ''),
(57, 'Θεωρία παιγνίων', 'ΕΕ', '4', ''),
(58, 'Διακριτά Μαθηματικά', 'ΕΚ-Π', '5', ''),
(59, 'Θεωρία Υπολογισμού ', 'ΕΚ-Π', '5', ''),
(60, 'Αλγόριθμοι και Πολυπλοκότητα', 'ΕΚ-Π', '5', ''),
(61, 'Τηλεφωνικά δίκτυα', 'ΕΚ-Τ', '5', ''),
(62, 'Υπολογιστικές Τεχνικές και Σχεδίαση Συστημάτων Ασύρματης Μετάδοσης', 'ΕΚ-Τ', '5', ''),
(63, 'Σχεδίαση VLSI Κυκλωμάτων', 'ΕΚ-ΠΤ', '5', ''),
(64, 'Προστασία και Επιβιωσιμότητα', 'ΕΚ-Τ', '5', ''),
(65, 'Αρχιτεκτονική μεταγωγέων και δρομολογητών ', 'ΕΚ-ΠΤ', '5', ''),
(66, 'Επίπεδο Ελέγχου Δικτύου - Αρχιτεκτονικές Κατανομής Πόρων σε Δίκτυα Υψηλών Ταχυτήτων', 'ΕΚ-Τ', '5', ''),
(67, 'Προγραμματισμός για Ασύρματα Διαδίκτυα και Κινητές Επιχειρήσεις (m-business)', 'ΕΚ-ΠΤ', '5', ''),
(68, 'Προγραμματισμός Ιστοσελίδων (Web Design) ', 'ΕΚ-ΠΤ', '5', ''),
(69, 'Κρυπτολογία (Κρυπτογραφία - Κρυπτανάλυση)', 'ΕΚ-Π', '5', ''),
(70, 'Ηλεκτρονικά Τηλεπικοινωνιακά Συστήματα', 'ΕΚ-Τ', '5', ''),
(71, 'Σύγχρονες Τάσεις και Νομικά Θέματα στις Τηλεπικοινωνίες', 'ΕΕ', '4', ''),
(72, 'Οικονομικά και Επιχειρηματικά Θέματα στις Τηλεπικοινωνίες', 'ΕΕ', '4', ''),
(73, 'Εισαγωγή στην Οικονομική Επιστήμη ΙΙ ', 'ΕΕ', '4', ''),
(74, 'Εισαγωγή στην Οικονομική Επιστήμη Ι', 'ΕΕ', '4', ''),
(75, 'Γενικά Αγγλικά', 'ΕΕ', '4', ''),
(76, 'Γενικά Γαλλικά και Ορολογία ', 'ΕΕ', '4', ''),
(77, 'Φιλοσοφία και Ποίηση ', 'ΕΕ', '4', ''),
(78, 'Παιδαγωγικά', 'ΕΕ-Π', '5', ''),
(79, 'Κοινωνιολογία', 'ΕΕ', '4', ''),
(80, 'Ψυχολογία', 'ΕΕ', '5', ''),
(81, 'Πρακτική άσκηση', 'ΕΕ', '3', ''),
(82, 'Επιχειρηματικότητα και Διοίκηση Επιχειρήσεων', 'ΕΕ', '4', ''),
(83, 'Ανάπτυξη Νέων Προϊόντων και Υπηρεσιών', 'ΕΕ', '4', '');

-- --------------------------------------------------------

--
-- Table structure for table `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2012`
--

CREATE TABLE `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2012` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `category` varchar(255) NOT NULL,
  `ects` varchar(255) NOT NULL,
  `correspondence` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2012`
--

INSERT INTO `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2012` (`id`, `name`, `category`, `ects`, `correspondence`) VALUES
(1, 'Εισαγωγή στην Επιστήμη και Τεχνολογία της Πληροφορικής και των\r\nΤηλεπικοινωνιών', 'Κ', '6', 'Εισαγωγή στην Πληροφορική και Τηλεπικοινωνίες'),
(2, 'Εισαγωγή στον Προγραμματισμό', 'Κ', '6', 'Προγραμματισμός Ι'),
(3, 'Λογική Σχεδίαση', 'Κ', '6', 'Λογική Σχεδίαση'),
(4, 'Ηλεκτρονική', 'Κ', '6', 'Ηλεκτρονική'),
(5, 'Προγραμματισμός ΙΙ', 'Κ', '6', 'Προγραμματισμός ΙΙ'),
(6, 'Σήματα και Συστήματα', 'Κ', '6', 'Σήματα και Συστήματα'),
(7, 'Δίκτυα Επικοινωνιών Ι', 'Κ', '6', 'Δίκτυα Επικοινωνιών Ι'),
(8, 'Επικοινωνίες Ι', 'Κ', '6', 'Επικοινωνίες Ι'),
(9, 'Γραμμικά Ηλεκτρικά Κυκλώματα', 'Κ', '6', 'Γραμμικά Ηλεκτρικά Κυκλώματα'),
(10, 'Θεωρία Πληροφορίας και Κωδίκων', 'Κ', '6', 'Θεωρία Πληροφορίας και Κωδίκων'),
(11, 'Αντικειμενοστρεφής Προγραμματισμός (Java)', 'Κ', '6', 'Αντικειμενοστρεφής Προγραμματισμός'),
(12, 'Πεδία και Κύματα στις Επικοινωνίες', 'Κ', '6', 'Ηλεκτρομαγνητικά Πεδία'),
(13, 'Εισαγωγή στις Οπτικές Επικοινωνίες', 'Κ', '6', 'Εισαγωγή στις Οπτικές Επικοινωνίες'),
(14, 'Ασύρματες και Κινητές Επικοινωνίες Ι', 'Κ', '6', 'Ασύρματες και Κινητές Επικοινωνίες Ι'),
(15, 'Ασύρματες και Κινητές Επικοινωνίες ΙΙ', 'Κ', '6', 'Ασύρματες και Κινητές Επικοινωνίες ΙΙ ή Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(16, 'Ψηφιακή Επεξεργασία Σήματος', 'Κ', '6', 'Ψηφιακή Επεξεργασία Σήματος'),
(17, 'Δίκτυα Επικοινωνιών ΙΙ', 'Κ', '6', 'Δίκτυα Επικοινωνιών ΙΙ'),
(18, 'Επικοινωνίες ΙΙ', 'Κ', '6', 'Ψηφιακές Επικοινωνίες'),
(19, 'Ακαδημαϊκά Αγγλικά - Αγγλική Ορολογία Επιστήμης και Τεχνολογίας Επικοινωνιών', 'Κ', '6', 'Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(20, 'Φυσική Ι', 'Κ', '6', 'Φυσική ή Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(21, 'Φυσική ΙΙ', 'Κ', '6', 'Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(22, 'Μαθηματικά Ι', 'Κ', '6', 'Μαθηματικά Ι'),
(23, 'Εφαρμοσμένα Μαθηματικά', 'Κ', '6', 'Μαθηματικά ΙΙ ή Ένα επιπλέον μάθημα Κ ή ΒΚ-Π ή ΕΚ-Π ή ΕΚ-Τ'),
(24, 'Πιθανότητες και Στατιστική', 'Κ', '6', 'Πιθανότητες και Στατιστική'),
(25, 'Πτυχιακή Εργασία', 'Κ', '30', 'Πτυχιακή Εργασία'),
(26, 'Αναγνώριση Προτύπων και Ανάλυση Εικόνας', 'ΕΚ-ΠΤ', '5', ''),
(27, 'Προχωρημένα θέματα θεωρίας κωδίκων', 'ΕΚ-ΠΤ', '5', ''),
(28, 'Επεξεργασία - Αναγνώριση Ομιλίας', 'ΕΚ-Τ', '5', ''),
(29, 'Στοχαστική επεξεργασία σήματος και εφαρμογές', 'ΕΚ-Τ', '5', ''),
(30, 'Προσαρμοστικά Συστήματα στις Τηλεπικοινωνίες ', 'ΕΚ-Τ', '5', ''),
(31, 'Συμπίεση και Μετάδοση Πολυμέσων', 'ΕΚ-Τ', '5', ''),
(32, 'Επεξεργασία Εικόνας ', 'ΕΚ-ΠΤ', '5', ''),
(33, 'Μοντελοποίηση - Ταυτοποίηση - Εξίσωση Τηλεπικοινωνιακών Διαύλων', 'ΕΚ-Τ', '5', ''),
(34, 'Επεξεργαστές Ψηφιακών Σημάτων', 'ΕΚ-Τ', '5', ''),
(35, 'Ειδικά Θέματα Επεξεργασίας Σήματος ', 'ΕΚ-Τ', '5', ''),
(36, 'Θεωρία και Τεχνολογία Κεραιών', 'ΕΚ-Τ', '5', ''),
(37, 'Οπτοηλεκτρονική ', 'ΕΚ-Τ', '5', ''),
(38, 'Προχωρημένα Θέματα Οπτικών Επικοινωνιών', 'ΕΚ-Τ', '5', ''),
(39, 'Εργαστηριακές Εφαρμογές Συστημάτων και\r\nΔικτύων Οπτικών Ινών', 'ΕΚ-Τ', '5', ''),
(40, 'Μικροκύματα και Κυματοδηγοί ', 'ΕΚ-Τ', '5', ''),
(41, 'Ασύρματες ζεύξεις', 'ΕΚ-Τ', '5', ''),
(42, 'Σύγχρονα κυψελωτά συστήματα επικοινωνιών', 'ΕΚ-Τ', '5', ''),
(43, 'Συστήματα Εντοπισμού & Ραντάρ', 'ΕΚ-Τ', '5', ''),
(44, 'Δορυφορικές Επικοινωνίες', 'ΕΚ-Τ', '5', ''),
(45, 'Σχεδίαση Συστημάτων Μετάδοσης Ενσύρματων\r\nΔικτύων', 'ΕΚ-Τ', '5', ''),
(46, 'Ειδικά θέματα Τεχνολογίας Συστημάτων\r\nΕπικοινωνίας', 'ΕΚ-Τ', '5', ''),
(47, 'Αρχές Ψηφιακών Συστημάτων και\r\nΠροσομοίωση', 'ΕΚ-Τ', '5', ''),
(48, 'Στοχαστικά μοντέλα δικτύων και ανάλυση απόδοσης', 'ΕΚ-ΠΤ', '5', ''),
(49, 'Προγραμματισμός κατανεμημένων συστημάτων', 'ΕΚ-ΠΤ', '5', ''),
(50, 'Σχεδίαση εφαρμογών και υπηρεσιών διαδικτύου ', 'ΕΚ-ΠΤ', '5', ''),
(51, 'Διαχείριση και Ασφάλεια Δικτύων', 'ΕΚ-ΠΤ', '5', ''),
(52, 'Σχεδίαση πρωτοκόλλων επικοινωνίας ', 'ΕΚ-ΠΤ', '5', ''),
(53, 'Βάσεις Δεδομένων', 'ΕΚ-ΠΤ', '5', ''),
(54, 'Υλοποίηση Δικτυακών Υποδομών και Υπηρεσιών', 'ΕΚ-Τ', '5', ''),
(55, 'Τεχνικές προσομοίωσης δικτύων επικοινωνιών', 'ΕΚ-ΠΤ', '5', ''),
(56, 'Ειδικά Θέματα Δικτύων Επικοινωνιών, Υπηρεσιών και Εφαρμογών', 'ΕΚ-ΠΤ', '5', ''),
(57, 'Λειτουργικά Συστήματα – Προγραμ/σμός\r\nΣυστήματος', 'Κ', '5', ''),
(58, 'Δομές Δεδομένων', 'ΕΚ-ΠΤ', '5', ''),
(59, 'Δίκτυα Πρόσβασης Ευρείας Ζώνης', 'ΕΚ-Τ', '5', ''),
(60, 'Αρχιτεκτονική Υπολογιστών Ι ', 'ΕΚ-ΠΤ', '5', ''),
(61, 'Θεωρία παιγνίων', 'ΕΕ', '4', ''),
(62, 'Διακριτά Μαθηματικά', 'ΕΚ-Π', '5', ''),
(63, 'Θεωρία Υπολογισμού ', 'ΕΚ-Π', '5', ''),
(64, 'Αλγόριθμοι και Πολυπλοκότητα', 'ΕΚ-Π', '5', ''),
(65, 'Τηλεφωνικά δίκτυα', 'ΕΚ-Τ', '5', ''),
(66, 'Υπολογιστικές Τεχνικές και Σχεδίαση Συστημάτων Ασύρματης Μετάδοσης', 'ΕΚ-Τ', '5', ''),
(67, 'Σχεδίαση VLSI Κυκλωμάτων', 'ΕΚ-ΠΤ', '5', ''),
(68, 'Προστασία και Επιβιωσιμότητα', 'ΕΚ-Τ', '5', ''),
(69, 'Αρχιτεκτονική μεταγωγέων και δρομολογητών ', 'ΕΚ-ΠΤ', '5', ''),
(70, 'Επίπεδο Ελέγχου Δικτύου - Αρχιτεκτονικές Κατανομής Πόρων σε Δίκτυα Υψηλών Ταχυτήτων', 'ΕΚ-Τ', '5', ''),
(71, 'Προγραμματισμός για Ασύρματα Διαδίκτυα και Κινητές Επιχειρήσεις (m-business)', 'ΕΚ-ΠΤ', '5', ''),
(72, 'Προγραμματισμός Ιστοσελίδων (Web Design) ', 'ΕΚ-ΠΤ', '5', ''),
(73, 'Κρυπτολογία (Κρυπτογραφία - Κρυπτανάλυση)', 'ΕΚ-Π', '5', ''),
(74, 'Ηλεκτρονικά Τηλεπικοινωνιακά Συστήματα', 'ΕΚ-Τ', '5', ''),
(75, 'Σύγχρονες Τάσεις και Νομικά Θέματα στις Τηλεπικοινωνίες', 'ΕΕ', '4', ''),
(76, 'Οικονομικά και Επιχειρηματικά Θέματα στις Τηλεπικοινωνίες', 'ΕΕ', '4', ''),
(77, 'Εισαγωγή στην Οικονομική Επιστήμη ΙΙ ', 'ΕΕ', '4', ''),
(78, 'Εισαγωγή στην Οικονομική Επιστήμη Ι', 'ΕΕ', '4', ''),
(79, 'Γενικά Αγγλικά', 'ΕΕ', '4', ''),
(80, 'Γενικά Γαλλικά και Ορολογία ', 'ΕΕ', '4', ''),
(81, 'Φιλοσοφία και Ποίηση ', 'ΕΕ', '4', ''),
(82, 'Παιδαγωγικά', 'ΕΕ-Π', '5', ''),
(83, 'Κοινωνιολογία', 'ΕΕ', '4', ''),
(84, 'Ψυχολογία', 'ΕΕ', '5', ''),
(85, 'Πρακτική άσκηση', 'ΕΕ', '3', ''),
(86, 'Επιχειρηματικότητα και Διοίκηση Επιχειρήσεων', 'ΕΕ', '4', ''),
(87, 'Ανάπτυξη Νέων Προϊόντων και Υπηρεσιών', 'ΕΕ', '4', '');

-- --------------------------------------------------------

--
-- Table structure for table `επιστήμης και τεχνολογίας _υπολογιστών_2002_2003`
--

CREATE TABLE `επιστήμης και τεχνολογίας _υπολογιστών_2002_2003` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `category` varchar(255) NOT NULL,
  `ects` varchar(255) NOT NULL,
  `correspondence` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `επιστήμης και τεχνολογίας _υπολογιστών_2002_2003`
--

INSERT INTO `επιστήμης και τεχνολογίας _υπολογιστών_2002_2003` (`id`, `name`, `category`, `ects`, `correspondence`) VALUES
(25, 'Θεωρία γλωσσών προγραμματισμού & μεταγλωττιστές', 'ΒΚ-ΘΠ', '0', 'Μεταγλωττιστές Ι'),
(26, 'Γραφικά – Fractals', 'ΒΚ-ΘΠ', '0', 'Γραφικά'),
(27, 'Κρυπτολογία (κρυπτογραφία & κρυπτανάλυση)', 'ΒΚ-ΘΠ', '0', 'Κρυπτογραφία'),
(28, 'Αλγοριθμική επιχειρησιακή έρευνα σε καμία περίπτωση', 'ΒΚ-ΘΠ', '0', 'Υπολογιστική γεωμετρία ή Εισαγωγή στη θεωρία πληροφορίας και κωδίκων'),
(29, 'Συνδυαστική βελτιστοποίηση', 'ΒΚ-ΘΠ', '0', 'Συνδυαστική βελτιστοποίηση'),
(30, 'Παράλληλοι αλγόριθμοι', 'ΒΚ-ΘΠ', '0', 'Παράλληλοι αλγόριθμοι'),
(31, 'Τεχνητή νοημοσύνη', 'ΒΚ-ΣΛ', '0', 'Τεχνητή νοημοσύνη'),
(32, 'Ανάλυση συστημάτων', 'ΒΚ-ΣΛ', '0', 'Τεχνολογία λογισμικού ή Προηγμένα θέματα προγραμματισμού\r\nή Μάθημα κατεύθυνσης πληροφορικής'),
(33, 'Επικοινωνία ανθρώπου – μηχανής', 'ΒΚ-ΣΛ', '0', 'Διάδραση ανθρώπου - υπολογιστή'),
(34, 'Λογικός & συναρτησιακός προγραμματισμός', 'ΒΚ-ΣΛ', '0', 'Ανάκτηση πληροφορίας ή Ανάκτηση και εξόρυξη πληροφοριών'),
(35, 'Προστασία και ασφάλεια πληροφοριακών συστημάτων', 'ΒΚ-ΣΛ', '0', 'Ασφάλεια συστημάτων'),
(36, 'Λογισμικό προηγμένων συστημάτων', 'ΒΚ-ΣΛ', '0', 'Διαχείριση πληροφορίας στο διαδίκτυο'),
(37, 'Προηγμένα θέματα συστημάτων λογισμικού', 'ΒΚ-ΣΛ', '0', '• Έως και 2012–13: Μάθημα κορμού ή Μάθημα κατεύθυνσης συ- στημάτων λογισμικού ή Μάθημα άλλης κατεύθυνσης (με σειρά\nπροτεραιότητας)<br>\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(38, 'Σχεδίαση ψηφιακών συστημάτων', 'ΒΚ-ΤΥ', '0', '• Έως και 2012–13: Σχεδίαση ψηφιακών κυκλωμάτων ή Μάθημα κορμού ή Μάθημα κατεύθυνσης τεχνολογίας υπολογιστών ή\nΜάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)<br>\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(39, 'Προηγμένες αρχιτεκτονικές υπολογιστών', 'ΒΚ-ΤΥ', '0', 'Αρχιτεκτονική υπολογιστών ΙΙ'),
(40, 'Θεωρία κωδίκων και εφαρμογές', 'ΒΚ-ΤΥ', '0', '• Έως και 2012–13: Θεωρία πληροφορίας και κωδίκων<br>\n• 2013–14 και μετά: Εισαγωγή στη θεωρία πληροφορίας και κωδίκων'),
(41, 'Επεξεργασία σήματος', 'ΒΚ-ΤΥ', '0', 'Ψηφιακή επεξεργασία σήματος'),
(42, 'Τεχνολογία πολυμέσων & εικονικής\r\nπραγματικότητας', 'ΒΚ-ΤΥ', '0', '• Έως και 2012–13: Τεχνολογία πολυμέσων<br>\n• 2013–14 και μετά: είτε (1) Προηγμένες διεπαφές - Εικονική\nπραγματικότητα είτε (2) Μάθημα κορμού ή μάθημα κατεύθυνσης\nπληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)<br> (με σειρά προτεραιότητας μεταξύ των (1) και (2))'),
(43, 'Προηγμένα λειτουργικά συστήματα', 'ΒΚ-ΤΥ', '0', '• Έως και 2012–13: Μάθημα κορμού ή Μάθημα κατεύθυνσης τεχνολογίας υπολογιστών ή Μάθημα άλλης κατεύθυνσης (με σειρά\nπροτεραιότητας)<br>\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(44, 'Υπολογιστική επιστήμη', 'ΕΠ-ΘΠ', '0', '• Έως και 2012–13: Υπολογιστική πολυπλοκότητα ή Μάθημα κατεύθυνσης θεωρητικής πληροφορικής ή Μάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)<br>\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(45, 'Υπολογιστική γεωμετρία', 'ΕΠ-ΘΠ', '0', 'Υπολογιστική γεωμετρία'),
(46, 'Ειδικά θέματα θεωρητικής πληροφορικής', 'ΕΠ-ΘΠ', '0', '• Έως και 2012–13: Υπολογιστική πολυπλοκότητα ή Μάθημα κατεύθυνσης θεωρητικής πληροφορικής ή Μάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)<br>\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(47, 'Πρακτική άσκηση Θ.Π.', 'ΕΠ-ΘΠ', '0', '• Έως και 2012–13: Υπολογιστική πολυπλοκότητα ή Μάθημα κατεύθυνσης θεωρητικής πληροφορικής ή Μάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)<br>\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(48, 'Διαφορικές εξισώσεις', 'ΕΠ-ΘΠ', '0', '• Έως και 2012–13: Υπολογιστική πολυπλοκότητα ή Μάθημα κατεύθυνσης θεωρητικής πληροφορικής ή Μάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)<br>\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(49, 'Θεωρία αριθμών', 'ΕΠ-ΘΠ', '0', '• Έως και 2012–13: Υπολογιστική πολυπλοκότητα ή Μάθημα κατεύθυνσης θεωρητικής πληροφορικής ή Μάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)<br>\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης'),
(50, 'Θεωρία γραφημάτων', 'ΕΠ-ΘΠ', '0', '• Έως και 2012–13: Υπολογιστική πολυπλοκότητα ή Μάθημα κατεύθυνσης θεωρητικής πληροφορικής ή Μάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)<br>\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(51, 'Αλγοριθμική επιχειρησιακή έρευνα', 'ΕΠ-ΘΠ', '0', '• Έως και 2012–13: Υπολογιστική πολυπλοκότητα ή Μάθημα κατεύθυνσης θεωρητικής πληροφορικής ή Μάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)<br>\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(52, 'Υπηρεσίες διαδικτύου', 'ΕΠ-ΣΛ', '0', '• Έως και 2012–13: Μάθημα κατεύθυνσης συστημάτων λογισμικού ή Μάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)<br>\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(53, 'Έμπειρα συστήματα και εφαρμογές', 'ΕΠ-ΣΛ', '0', '• Έως και 2012–13: Μάθημα κατεύθυνσης συστημάτων λογισμικού ή Μάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)<br>\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(54, 'Ειδικά θέματα συστημάτων λογισμικού', 'ΕΠ-ΣΛ', '0', '• Έως και 2012–13: Μάθημα κατεύθυνσης συστημάτων λογισμικού ή Μάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)<br>\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(55, 'Πρακτική άσκηση Σ.Λ.', 'ΕΠ-ΣΛ', '0', '• Έως και 2012–13: Μάθημα κατεύθυνσης συστημάτων λογισμικού ή Μάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)<br>\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(56, 'Σχεδίαση VLSI κυκλωμάτων', 'ΕΠ-ΤΥ', '0', '• Έως και 2012–13: Σχεδίαση ψηφιακών κυκλωμάτων ή Μάθημα κορμού ή Μάθημα κατεύθυνσης τεχνολογίας υπολογιστών ή\r\nΜάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)\r\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(57, 'Σχεδίαση εγκαταστάσεων υπολογιστικών κέντρων', 'ΕΠ-ΤΥ', '0', '• Έως και 2012–13: Μάθημα κορμού ή Μάθημα κατεύθυνσης τε- χνολογίας υπολογιστών ή Μάθημα άλλης κατεύθυνσης (με σειρά\nπροτεραιότητας)<br>\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(58, 'Ειδικά θέματα τεχνολογίας υπολογιστών', 'ΕΠ-ΤΥ', '0', '• Έως και 2012–13: Μάθημα κορμού ή Μάθημα κατεύθυνσης τε- χνολογίας υπολογιστών ή Μάθημα άλλης κατεύθυνσης (με σειρά\r\nπροτεραιότητας)\r\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(59, 'Πρακτική άσκηση Τ.Υ.', 'ΕΠ-ΤΥ', '0', '• Έως και 2012–13: Μάθημα κορμού ή Μάθημα κατεύθυνσης τεχνολογίας υπολογιστών ή Μάθημα άλλης κατεύθυνσης (με σειρά\nπροτεραιότητας)<br>\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(60, 'Νομική Πληροφορική ', 'ΕΛ', '0', 'Νομική Πληροφορική '),
(61, 'Κοινωνικά και Επαγγελματικά Θέματα ', 'ΕΛ', '0', 'Κοινωνικά και Επαγγελματικά Θέματα '),
(62, '∆ιδακτική της Πληροφορικής ', 'ΕΛ-Π', '0', '∆ιδακτική της Πληροφορικής '),
(63, 'Ψυχολογία ', 'ΕΛ', '0', 'Ψυχολογία '),
(64, 'Πληροφορική και Εκπαίδευση ', 'ΕΛ-Π', '0', 'Πληροφορική και Εκπαίδευση '),
(65, '∆ημόσια ∆ιοίκηση', 'ΕΛ', '0', '∆ημόσια ∆ιοίκηση'),
(66, 'Κοινωνιολογία ', 'ΕΛ', '0', 'Κοινωνιολογία '),
(67, 'Ελεύθερο μάθημα ομάδας 0', 'ΕΛ', '0', 'Ελεύθερο μάθημα ομάδας'),
(68, 'Γενικά Αγγλικά', 'ΕΛ', '0', 'Γενικά Αγγλικά'),
(69, 'Γενικά Γαλλικά και Ορολογία', 'ΕΛ', '0', 'Γενικά Γαλλικά και Ορολογία'),
(70, 'Ξένη Γλώσσα', 'ΕΛ', '0', 'Ξένη Γλώσσα'),
(71, 'Πληροφοριακά Συστήματα ∆ιοίκησης ', 'ΕΛ', '0', 'Πληροφοριακά Συστήματα ∆ιοίκησης '),
(72, 'Θεωρία Παιγνίων', 'ΕΛ', '0', 'Θεωρία Παιγνίων'),
(73, 'Γνωσιακή Επιστήμη', 'ΕΛ', '0', 'Γνωσιακή Επιστήμη'),
(74, 'Τραπεζική Πληροφορική', 'ΕΛ', '0', 'Τραπεζική Πληροφορική'),
(75, '∆ιοίκηση Έργων Πληροφορικής ', 'ΕΛ', '0', '∆ιοίκηση Έργων Πληροφορικής '),
(76, 'Φιλοσοφία και ποίηση ', 'ΕΛ', '0', 'Φιλοσοφία και ποίηση '),
(77, 'Παιδαγωγικά ', 'ΕΛ-Π', '0', 'Παιδαγωγικά '),
(78, 'Ελεύθερο μάθημα ομάδας 1 ', 'ΕΛ', '0', 'Ελεύθερο μάθημα ομάδας 1 '),
(79, 'Εισαγωγή στην Ε&Τ της πληροφορικής', 'Κ', '0', 'Εισαγωγή στην πληροφορική και τις τηλεπικοινωνίες'),
(80, 'Αλγόριθμοι και πολυπλοκότητα', 'Κ', '0', 'Αλγόριθμοι και πολυπλοκότητα'),
(81, 'Θεωρία υπολογισμού', 'Κ', '0', 'Υπολογισιμότητα και πολυπλοκότητα'),
(82, 'Δομές δεδομένων και αλγόριθμοι αναζήτησης', 'Κ', '0', 'Δομές δεδομένων'),
(83, 'Αρχές προγραμματισμού (C)', 'Κ', '0', 'Προγραμματισμός Ι'),
(84, 'Αντικειμενοστρεφής προγραμματισμός', 'Κ', '0', 'Αντικειμενοστρεφής προγραμματισμός'),
(85, 'Προγραμματισμός συστήματος ή\r\nΠρογραμματισμός συστήματος και\r\nπροηγμένα λειτουργικά', 'Κ', '0', 'Προγραμματισμός συστήματος'),
(86, 'Τεχνολογία λογισμικού', 'Κ', '0', 'Τεχνολογία λογισμικού'),
(87, 'Διαχείριση αρχείων πληροφοριών', 'Κ', '0', 'Συστήματα διαχείρισης δεδομένων'),
(88, 'Βάσεις δεδομένων και ΣΔΒΔ', 'Κ', '0', 'Βάσεις δεδομένων'),
(89, 'Λογική σχεδίαση', 'Κ', '0', '• Έως και 2012–13: Ψηφιακή σχεδίαση <br>\r\n• 2013–14 και μετά: Λογική σχεδίαση'),
(90, 'Αρχιτεκτονική υπολογιστών', 'Κ', '0', 'Αρχιτεκτονική υπολογιστών Ι'),
(91, 'Λειτουργικά συστήματα', 'Κ', '0', 'Λειτουργικά συστήματα'),
(92, 'Δίκτυα υπολογιστών', 'Κ', '0', '•Έως και 2012–13: Δίκτυα και επικοινωνίες υπολογιστών Ι <br>\r\n• 2013–14 και μετά: Δίκτυα επικοινωνιών Ι'),
(93, 'Ιστορία των υπολογιστών & των τηλεπικοινωνιών', 'Κ', '0', 'Προηγμένα θέματα προγραμματισμού'),
(94, 'Αγγλική ορολογία Ε&Τ υπολογιστών ', 'Κ', '0', '• Έως και 2012–13: Αγγλικά <br> • 2013–14 και μετά: Μεθοδολογία έρευνας και συγγραφής εργασιών'),
(95, 'Πτυχιακή εργασία', 'Κ', '0', 'Πτυχιακή εργασία'),
(96, 'Διακριτά μαθηματικά', 'Κ', '0', 'Διακριτά μαθηματικά'),
(97, 'Αριθμητική ανάλυση', 'Κ', '0', 'Αριθμητική ανάλυση'),
(98, 'Φυσική', 'Κ', '0', '•Έως και 2012–13: Μάθημα κορμού 1ου ή 2ου έτους ή μάθημα\r\nελεύθερης επιλογής (με σειρά προτεραιότητας) <br>\r\n• 2013–14 και μετά: Φυσική'),
(99, 'Αριθμητική γραμμική άλγεβρα', 'Κ', '0', '• Έως και 2008–09: Αριθμητική γραμμική άλγεβρα ή Γραμμική\r\nάλγεβρα και αριθμητική γραμμική άλγεβρα ή Γραμμική άλγεβρα<br>\r\n• 2009–10 έως και 2011–12: Μαθηματικά Ι <br>\r\n• 2012–13: Γραμμική άλγεβρα και θεωρία αριθμών <br>\r\n• 2013–14 και μετά: Μαθηματικά Ι <br>'),
(100, 'Ανάλυση Ι', 'Κ', '0', '• Έως και 2008–09: Ανάλυση Ι ή Μαθηματικός Λογισμός Ι <br>\r\n• 2009–10 έως και 2011–12: Μαθηματικά ΙΙ ή μάθημα κορμού \r\n1ου ή 2ου έτους ή μάθημα ελεύθερης επιλογής (με σειρά προτεραιότητας)\r\n• 2012–13: Μαθηματική Ανάλυση<br>\r\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(101, 'Ανάλυση ΙΙ', 'Κ', '0', '• Έως και 2008–09: Ανάλυση ΙΙ ή Μαθηματικός Λογισμός ΙΙ <br>\r\n• 2009–10 έως και 2011–12: Μαθηματικά ΙΙ ή μάθημα κορμού \r\n1ου ή 2ου έτους ή μάθημα ελεύθερης επιλογής (με σειρά προτεραιότητας)\r\n• 2012–13: Μάθημα κορμού ή κατεύθυνσης υπολογιστών (με σειρά προτεραιότητας)<br>\r\n• 2013–14 και μετά: Μαθηματικά ΙΙ'),
(102, 'Πιθανότητες και στατιστική', 'Κ', '0', '•Έως και 2008–09: Πιθανότητες και στατιστική <br>\r\n• 2009–10 έως και 2011–12: Μαθηματικά ΙΙ ή μάθημα κορμού\r\n1ου ή 2ου έτους ή μάθημα ελεύθερης επιλογής (με σειρά προτεραιότητας)<br>\r\n• 2012–13: Θεωρία πιθανοτήτων και στατιστική<br>\r\n• 2013–14 και μετά: Πιθανότητες και στατιστική');

-- --------------------------------------------------------

--
-- Table structure for table `επιστήμης και τεχνολογίας _υπολογιστών_2004__2005__2006`
--

CREATE TABLE `επιστήμης και τεχνολογίας _υπολογιστών_2004__2005__2006` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `category` varchar(255) NOT NULL,
  `ects` varchar(255) NOT NULL,
  `correspondence` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `επιστήμης και τεχνολογίας _υπολογιστών_2004__2005__2006`
--

INSERT INTO `επιστήμης και τεχνολογίας _υπολογιστών_2004__2005__2006` (`id`, `name`, `category`, `ects`, `correspondence`) VALUES
(1, 'Εισαγωγή στον προγραμματισμό ή\r\nΑρχές προγραμματισμού (C)', 'Κ', '0', 'Προγραμματισμός Ι'),
(2, 'Εισαγωγή στην Ε&Τ των υπολογιστών ή Εισαγωγή στην Ε&Τ της πληροφορικής', 'Κ', '0', 'Εισαγωγή στην πληροφορική και τις τηλεπικοινωνίες'),
(3, 'Λογική σχεδίαση', 'Κ', '0', '• Έως και 2012–13: Ψηφιακή σχεδίαση\n• 2013–14 και μετά: Λογική σχεδίαση'),
(4, 'Αγγλικά ή Αγγλική ορολογία ή Αγγλική ορολογία Ε&Τ υπολογιστών', 'Κ', '0', '• Έως και 2012–13: Αγγλικά\r\n• 2013–14 και μετά: Μεθοδολογία έρευνας και συγγραφής εργασιών'),
(5, 'Αρχές προγραμματισμού', 'Κ', '0', 'Προγραμματισμός ΙΙ'),
(6, 'Διακριτά μαθηματικά', 'Κ', '0', 'Διακριτά μαθηματικά'),
(7, 'Οργάνωση υπολογιστικών συστημάτων', 'Κ', '0', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπι- κοινωνιών (βασικό ή επιλογής)'),
(8, 'Αριθμητική ανάλυση', 'Κ', '0', 'Αριθμητική ανάλυση'),
(9, 'Δομές δεδομένων', 'Κ', '0', 'Δομές δεδομένων'),
(10, 'Αντικειμενοστρεφής προγραμματισμός', 'Κ', '0', 'Αντικειμενοστρεφής προγραμματισμός'),
(11, 'Αλγόριθμοι και πολυπλοκότητα', 'Κ', '0', 'Αλγόριθμοι και πολυπλοκότητα'),
(12, 'Αρχιτεκτονική υπολογιστών', 'Κ', '0', 'Αρχιτεκτονική υπολογιστών Ι'),
(13, 'Δίκτυα επικοινωνιών', 'Κ', '0', '• Έως και 2012–13: Δίκτυα και επικοινωνίες υπολογιστών Ι\r\n• 2013–14 και μετά: Δίκτυα επικοινωνιών Ι\r\n'),
(14, 'Λογικός και συναρτησιακός προγραμματισμός', 'Κ', '0', 'Προηγμένα θέματα προγραμματισμού'),
(15, 'Λειτουργικά συστήματα', 'Κ', '0', 'Λειτουργικά συστήματα'),
(16, 'Τεχνολογία λογισμικού', 'Κ', '0', 'Τεχνολογία λογισμικού'),
(17, 'Εισαγωγή στις γλώσσες περιγραφής υλικού', 'Κ', '0', '• Έως και 2012–13: Γλώσσες περιγραφής υλικού Ι • 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(18, 'Θεωρία υπολογισμού', 'Κ', '0', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(19, 'Βάσεις δεδομένων', 'Κ', '0', 'Βάσεις δεδομένων'),
(20, 'Διάδραση ανθρώπου-υπολογιστή', 'Κ', '0', 'Διάδραση ανθρώπου-υπολογιστή'),
(21, 'Μεταγλωττιστές', 'Κ', '0', 'Μεταγλωττιστές Ι'),
(22, 'Προγραμματισμός συστήματος', 'Κ', '0', 'Προγραμματισμός συστήματος'),
(23, 'Φυσική-Ηλεκτρονική', 'Κ', '0', '• Έως και 2012–13: Μάθημα κορμού 1ου ή 2ου έτους ή μάθημα\r\nελεύθερης επιλογής (με σειρά προτεραιότητας)\r\n• 2013–14 και μετά: Φυσική'),
(24, 'Υπολογιστική επιστήμη Ι', 'Κ', '0', '• Έως και 2012–13: Μάθημα κορμού 2ου έτους ή μάθημα ελεύθερης επιλογής (με σειρά προτεραιότητας)\r\n• 2013–14 και μετά: Μάθημα κορμού 1ου ή 2ου έτους'),
(25, 'Γραμμική άλγεβρα ή Γραμμική άλγεβρα και αριθμητική γραμμική άλγεβρα', 'Κ', '0', '• Έως και 2008–09: Γραμμική άλγεβρα και αριθμητική γραμμική άλγεβρα ή Γραμμική άλγεβρα • 2009–10 έως και 2011–12: Μαθηματικά Ι\r\n• 2012–13: Γραμμική άλγεβρα και θεωρία αριθμών\r\n• 2013–14 και μετά: Μαθηματικά Ι'),
(26, 'Μαθηματικός λογισμός Ι ή Ανάλυση\r\nΙ\r\n', 'Κ', '0', '• Έως και 2008–09: Ανάλυση Ι ή Μαθηματικός Λογισμός Ι\r\n• 2009–10 έως και 2011–12: Μαθηματικά ΙΙ ή μάθημα κορμού\r\n1ου ή 2ου έτους ή μάθημα ελεύθερης επιλογής (με σειρά προτεραιότητας)\r\n• 2012–13: Μαθηματική Ανάλυση\r\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(27, 'Μαθηματικός λογισμός ΙΙ ή Ανάλυση ΙΙ', 'Κ', '0', '• Έως και 2008–09: Ανάλυση ΙΙ ή Μαθηματικός Λογισμός ΙΙ • 2009–10 έως και 2011–12: Μαθηματικά ΙΙ ή μάθημα κορμού\r\n1ου ή 2ου έτους ή μάθημα ελεύθερης επιλογής (με σειρά προτεραιότητας)\r\n• 2012–13: Μάθημα κορμού ή κατεύθυνσης υπολογιστών (με σειρά προτεραιότητας)\r\n• 2013–14 και μετά: Μαθηματικά ΙΙ'),
(28, 'Πιθανότητες και στατιστική', 'Κ', '0', '• Έως και 2008–09: Πιθανότητες και στατιστική\r\n• 2009–10 έως και 2011–12: Μαθηματικά ΙΙ ή μάθημα κορμού\r\n1ου ή 2ου έτους ή μάθημα ελεύθερης επιλογής (με σειρά προτεραιότητας)\r\n• 2012–13: Θεωρία πιθανοτήτων και στατιστική\r\n• 2013–14 και μετά: Πιθανότητες και στατιστική'),
(29, 'Πτυχιακή εργασία', 'Κ', '0', 'Πτυχιακή εργασία'),
(30, 'Υπολογιστική πολυπλοκότητα', 'ΒΚ-ΘΠ', '0', 'Υπολογισιμότητα και πολυπλοκότητα'),
(31, 'Κρυπτογραφία & κρυπτανάλυση', 'ΒΚ-ΘΠ', '0', 'Κρυπτογραφία'),
(32, 'Παράλληλοι αλγόριθμοι', 'ΒΚ-ΘΠ', '0', 'Παράλληλοι αλγόριθμοι'),
(33, 'Υπολογιστική επιστήμη ΙΙ', 'ΒΚ-ΘΠ', '0', '• Έως και 2012–13: Μάθημα κορμού ή μάθημα κατεύθυνσης θεωρητικής πληροφορικής ή μάθημα ελεύθερης επιλογής (με σειρά\r\nπροτεραιότητας)\r\n• 2013–14 και μετά: μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(34, 'Υπολογιστική γεωμετρία', 'ΒΚ-ΘΠ', '0', 'Υπολογιστική γεωμετρία'),
(35, 'Προστασία και ασφάλεια υπολογιστικών συστημάτων', 'ΒΚ-ΘΠ', '0', 'Ασφάλεια συστημάτων'),
(36, 'Τεχνολογία λογισμικού ΙΙ ή Υπηρεσίες διαδικτύου', 'ΒΚ-ΣΛ', '0', '• Έως και 2012–13: Μάθημα κορμού ή Μάθημα κατεύθυνσης Συ- στημάτων λογισμικού ή Μάθημα άλλης κατεύθυνσης (με σειρά\r\nπροτεραιότητας)\r\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(37, 'Τεχνητή νοημοσύνη', 'ΒΚ-ΣΛ', '0', 'Τεχνητή νοημοσύνη'),
(38, 'Συστήματα διαχείρισης δεδομένων\r\nή Συστήματα διαχείρισης βάσεων\r\nδεδομένων', 'ΒΚ-ΣΛ', '0', 'Συστήματα διαχείρισης δεδομένων'),
(39, 'Προηγμένες διεπαφές - εικονική\r\nπραγματικότητα', 'ΒΚ-ΣΛ', '0', 'Προηγμένες διεπαφές - εικονική\r\nπραγματικότητα'),
(40, 'Πληροφοριακά συστήματα', 'ΒΚ-ΣΛ', '0', '• Έως και 2012–13: Μάθημα κορμού ή Μάθημα κατεύθυνσης Συστημάτων λογισμικού ή Μάθημα άλλης κατεύθυνσης (με σειρά\r\nπροτεραιότητας)\r\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(41, 'Ευφυή συστήματα και εφαρμογές', 'ΒΚ-ΣΛ', '0', '• Έως και 2012–13: Μάθημα κορμού ή Μάθημα κατεύθυνσης Συστημάτων λογισμικού ή Μάθημα άλλης κατεύθυνσης (με σειρά\r\nπροτεραιότητας)\r\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(42, 'Προηγμένα θέματα αρχιτεκτονικής\r\nυπολογιστών', 'ΒΚ-ΤΥ', '0', 'Είτε (1) Αρχιτεκτονική υπολογιστών ΙΙ είτε (2) Μάθημα κορμού ή\r\nμάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό\r\nή επιλογής) (με σειρά προτεραιότητας μεταξύ των (1) και (2))'),
(43, 'Γλώσσες περιγραφής υλικού', 'ΒΚ-ΤΥ', '0', '• Έως και 2012–13: Γλώσσες περιγραφής υλικού ΙΙ\r\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(44, 'Σχεδιασμός ψηφιακών συστημάτων', 'ΒΚ-ΤΥ', '0', '• Έως και 2012–13: Σχεδίαση ψηφιακών κυκλωμάτων ή Μάθημα κορμού ή Μάθημα κατεύθυνσης τεχνολογίας υπολογιστών ή\r\nΜάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)\r\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(45, 'Σχεδίαση ψηφιακών ολοκληρωμένων κυκλωμάτων', 'ΒΚ-ΤΥ', '0', '• Έως και 2012–13: Σχεδίαση ψηφιακών κυκλωμάτων ή Μάθη- μα κορμού ή Μάθημα κατεύθυνσης τεχνολογίας υπολογιστών ή\r\nΜάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)\r\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(46, 'Τεχνολογία πολυμέσων', 'ΒΚ-ΤΥ', '0', '• Έως και 2012–13: Τεχνολογία πολυμέσων\r\n• 2013–14 και μετά: είτε (1) Προηγμένες διεπαφές - Εικονική\r\nπραγματικότητα είτε (2) Μάθημα κατεύθυνσης πληροφορικής ή\r\nτηλεπικοινωνιών (βασικό ή επιλογής) (με σειρά προτεραιότητας μεταξύ των (1) και (2))'),
(47, 'Συνδυαστική βελτιστοποίηση', 'ΕΠ-ΘΠ', '0', 'Συνδυαστική βελτιστοποίηση'),
(48, 'Αλγοριθμική θεωρία γραφημάτων', 'ΕΠ-ΘΠ', '0', 'Θεωρία γραφημάτων'),
(49, 'Γραφικά – Fractals', 'ΕΠ-ΘΠ', '0', 'Γραφικά υπολογιστών'),
(50, 'Κρυπτογραφία και κρυπτανάλυση ΙΙ', 'ΕΠ-ΘΠ', '0', '• Έως και 2012–13: Θεωρία πληροφορίας και κωδίκων ή Μάθημα κατεύθυνσης θεωρητικής πληροφορικής ή Μάθημα άλλης\r\nκατεύθυνσης (με σειρά προτεραιότητας)\r\n• 2013–14 και μετά: είτε (1) Εισαγωγή στη θεωρία πληροφορίας και κωδίκων είτε (2) Μάθημα κορμού ή μάθημα κατεύθυνσης\r\nπληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής) (με σειρά προτεραιότητας μεταξύ των (1) και (2))'),
(51, 'Αριθμητική επίλυση διαφορικών εξισώσεων', 'ΕΠ-ΘΠ', '0', '• Έως και 2012–13: Θεωρία πληροφορίας και κωδίκων ή Μά- θημα κατεύθυνσης θεωρητικής πληροφορικής ή Μάθημα άλλης\r\nκατεύθυνσης (με σειρά προτεραιότητας)\r\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(52, 'Ειδικά θέματα θεωρητικής πληροφορικής', 'ΕΠ-ΘΠ', '0', '• Έως και 2012–13: Προηγμένα θέματα θεωρητικής πληροφορι- κής ή Υπολογιστική πολυπλοκότητα ή Μάθημα κατεύθυνσης θεωρητικής πληροφορικής ή Μάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)\r\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(53, 'Υπηρεσίες διαδικτύου ή Τεχνολογία λογισμικού ΙΙ', 'ΕΠ-ΣΛ', '0', 'Κατανεμημένη διαχείριση πληροφορίας'),
(54, 'Τεχνικές μηχανικής μάθησης και εξόρυξης γνώσης', 'ΕΠ-ΣΛ', '0', '• Έως και 2012–13: Μάθημα κορμού ή Μάθημα κατεύθυνσης Συστημάτων λογισμικού ή Μάθημα άλλης κατεύθυνσης (με σειρά\r\nπροτεραιότητας)\r\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(55, 'Προηγμένα θέματα βάσεων δεδομένων', 'ΕΠ-ΣΛ', '0', '• Έως και 2012–13: Προηγμένα θέματα διαχείρισης πληροφοριών και δεδομένων\r\n• 2013–14 και μετά: Θέματα διαχείρισης πληροφοριών και δεδομένων'),
(56, 'Ειδικά θέματα συστημάτων λογισμικού', 'ΕΠ-ΣΛ', '0', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπι- κοινωνιών (βασικό ή επιλογής)'),
(57, 'Τεχνολογίες οπτικοποίησης δεδομένων και πληροφοριών', 'ΕΠ-ΤΥ', '0', '• Έως και 2012–13: Οπτικοποίηση δεδομένων και πληροφορίας • 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(58, 'Ψηφιακή επεξεργασία σήματος', 'ΕΠ-ΤΥ', '0', 'Ψηφιακή επεξεργασία σήματος'),
(59, 'Εισαγωγή στα ενσωματωμένα συστήματα', 'ΕΠ-ΤΥ', '0', 'Εισαγωγή στα ενσωματωμένα συστήματα'),
(60, 'Ρομποτική', 'ΕΠ-ΤΥ', '0', '• Έως και 2012–13: Μάθημα κατεύθυνσης τεχνολογίας υπολογιστών ή Μάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)\r\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(61, 'Ασύρματες και κινητές επικοινωνίες', 'ΕΠ-ΤΥ', '0', 'Έως και 2012–13: Μάθημα κατεύθυνσης τεχνολογίας υπολογι- στών ή Μάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)\r\n• 2013–14 και μετά: είτε (1) Ασύρματες και κινητές επικοινωνίες I είτε (2) Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής) (με σειρά προτεραιότητας μεταξύ των (1) και (2))'),
(62, 'Ειδικά θέματα τεχνολογίας υπολογιστών', 'ΕΠ-ΤΥ', '0', '• Έως και 2012–13: Μάθημα κατεύθυνσης τεχνολογίας υπολογι- στών ή Μάθημα άλλης κατεύθυνσης (με σειρά προτεραιότητας)\r\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(63, 'Ιστορία των υπολογιστών και τηλεπικοινωνιών', 'ΕΛ', '0', 'Ιστορία των υπολογιστών και τηλεπικοινωνιών'),
(64, 'Εργαστήριο C', 'ΕΛ', '0', 'Εργαστήριο C'),
(65, 'Εργαστήριο Java', 'ΕΛ', '0', 'Εργαστήριο Java'),
(66, 'Εργαστήριο C++', 'ΕΛ', '0', 'Εργαστήριο C++'),
(67, 'Νομική Πληροφορική', 'ΕΛ', '0', 'Νομική Πληροφορική'),
(68, 'Κοινωνικά και Επαγγελματικά\r\nΘέματα', 'ΕΛ', '0', 'Κοινωνικά και Επαγγελματικά\r\nΘέματα'),
(69, 'Διδακτική της Πληροφορικής', 'ΕΛ-Π', '0', 'Διδακτική της Πληροφορικής'),
(70, 'Ψυχολογία', 'ΕΛ', '0', 'Ψυχολογία'),
(71, ' Πληροφορική και Εκπαίδευση ', 'ΕΛ-Π', '0', ' Πληροφορική και Εκπαίδευση '),
(72, 'Δημόσια Διοίκηση', 'ΕΛ', '0', 'Δημόσια Διοίκηση'),
(73, 'Κοινωνιολογία', 'ΕΛ', '0', 'Κοινωνιολογία'),
(74, 'Ελεύθερο μάθημα ομάδας 0', 'ΕΛ', '0', 'Ελεύθερο μάθημα ομάδας 0'),
(75, 'Πληροφοριακά Συστήματα Διοίκησης', 'ΕΛ', '0', 'Πληροφοριακά Συστήματα Διοίκησης'),
(76, 'Θεωρία Παιγνίων ', 'ΕΛ', '0', 'Θεωρία Παιγνίων '),
(77, 'Γνωσιακή Επιστήμη', 'ΕΛ', '0', 'Γνωσιακή Επιστήμη'),
(78, 'Τραπεζική Πληροφορική', 'ΕΛ', '0', 'Τραπεζική Πληροφορική'),
(79, ' Διοίκηση Έργων Πληροφορικής', 'ΕΛ', '0', ' Διοίκηση Έργων Πληροφορικής'),
(80, 'Φιλοσοφία και ποίηση ', 'ΕΛ', '0', 'Φιλοσοφία και ποίηση '),
(81, 'Παιδαγωγικά ', 'ΕΛ-Π', '0', 'Παιδαγωγικά '),
(82, 'Ελεύθερο μάθημα ομάδας 1', 'ΕΛ', '0', 'Ελεύθερο μάθημα ομάδας 1'),
(83, 'Ιστορία των υπολογιστών και τηλεπικοινωνιών', 'ΕΛ', '0', 'Ιστορία των υπολογιστών και τηλεπικοινωνιών');

-- --------------------------------------------------------

--
-- Table structure for table `επιστήμης και τεχνολογίας _υπολογιστών_2007_2011`
--

CREATE TABLE `επιστήμης και τεχνολογίας _υπολογιστών_2007_2011` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `category` varchar(255) NOT NULL,
  `ects` varchar(255) NOT NULL,
  `correspondence` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `επιστήμης και τεχνολογίας _υπολογιστών_2007_2011`
--

INSERT INTO `επιστήμης και τεχνολογίας _υπολογιστών_2007_2011` (`id`, `name`, `category`, `ects`, `correspondence`) VALUES
(1, 'Ψηφιακή σχεδίαση', 'Κ1', '6', 'Λογική σχεδίαση'),
(2, 'Μαθηματικά Ι', 'Κ1', '6', '•Έως και 2011–12: Μαθηματικά Ι\n• 2012–13: Γραμμική Άλγεβρα και Θεωρία Αριθμών\n• 2013–14 και μετά: Μαθηματικά Ι'),
(3, 'Αγγλικά', 'Κ1', '6', 'Μεθοδολογία έρευνας και συγγραφής εργασιών'),
(4, 'Προγραμματισμός Ι', 'Κ1', '6', 'Προγραμματισμός Ι'),
(5, 'Εισαγωγή στην Ε&Τ της πληροφορικής', 'Κ1', '6', '• Έως και 2011–12: Εισαγωγή στην Ε&Τ της πληροφορικής\r\n• 2012–13: Εισαγωγή στην επιστήμη υπολογιστών\r\n• 2013–14 και μετά: Εισαγωγή στην πληροφορική και τις τηλεπικοινωνίες'),
(6, 'Οργάνωση υπολογιστικών συστημάτων', 'Κ1', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής\r\n'),
(7, 'Διακριτά μαθηματικά', 'Κ1', '6', 'Διακριτά μαθηματικά'),
(8, 'Μαθηματικά ΙΙ', 'Κ1', '6', '• Έως και 2011–12: Μαθηματικά II\r\n• 2012–13: Μαθηματική ανάλυση ή Θεωρία πιθανοτήτων και\r\nστατιστική\r\n• 2013–14 και μετά: Πιθανότητες και Στατιστική'),
(9, 'Προγραμματισμός ΙΙ', 'Κ1', '6', 'Προγραμματισμός ΙΙ'),
(10, 'Δίκτυα και επικοινωνίες υπολογιστών Ι', 'Κ1', '6', 'Δίκτυα επικοινωνιών Ι'),
(11, 'Δομές δεδομένων', 'Κ1', '6', 'Δομές δεδομένων'),
(12, 'Αρχιτεκτονική υπολογιστών Ι', 'Κ1', '6', 'Αρχιτεκτονική υπολογιστών Ι'),
(13, 'Αντικειμενοστρεφής προγραμματισμός', 'Κ1', '6', 'Αντικειμενοστρεφής προγραμματισμός'),
(14, 'Διάδραση ανθρώπου-υπολογιστή', 'Κ1', '6', 'Διάδραση ανθρώπου-υπολογιστή'),
(15, 'Προηγμένα θέματα προγραμματισμού', 'Κ1', '6', 'Προηγμένα θέματα προγραμματισμού'),
(16, 'Λειτουργικά συστήματα', 'Κ1', '6', 'Λειτουργικά συστήματα'),
(17, 'Αλγόριθμοι και πολυπλοκότητα', 'Κ1', '6', 'Αλγόριθμοι και πολυπλοκότητα'),
(18, 'Βάσεις δεδομένων', 'Κ1', '6', 'Βάσεις δεδομένων'),
(19, 'Θεωρία υπολογισμού', 'Κ1', '6', 'Είτε (1) Υπολογισιμότητα και πολυπλοκότητα είτε (2) μάθημα\nκορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής) (με σειρά προτεραιότητας μεταξύ των\n(1) και (2))'),
(20, 'Μεταγλωττιστές', 'Κ1', '6', 'Μεταγλωττιστές Ι'),
(21, 'Προγραμματισμός συστήματος', 'Κ1', '6', 'Προγραμματισμός συστήματος'),
(22, 'Πτυχιακή εργασία', 'Κ1', '30', 'Πτυχιακή εργασία'),
(23, 'Ασφάλεια συστημάτων', 'Κ1', '6', 'Ασφάλεια συστημάτων'),
(24, 'Αριθμητική ανάλυση (ΘΠ)', 'Κ2', '6', 'Αριθμητική ανάλυση '),
(25, 'Υπολογιστική πολυπλοκότητα (ΘΠ)', 'Κ2', '6', 'Υπολογισιμότητα και πολυπλοκότητα'),
(26, 'Γραφικά υπολογιστών (ΣΛ)', 'Κ2', '6', 'Γραφικά υπολογιστών (ΣΛ)'),
(27, 'Τεχνητή νοημοσύνη (ΣΛ)', 'Κ2', '6', 'Τεχνητή νοημοσύνη (ΣΛ)'),
(28, 'Ανάκτηση πληροφορίας (ΣΛ)', 'Κ2', '6', 'Ανάκτηση πληροφορίας ή Ανάκτηση και εξόρυξη πληροφοριών\r\n'),
(29, 'Γλώσσες περιγραφής Υλικού Ι (ΤΥ)', 'Κ2', '6', '• Έως και 2012–13: Γλώσσες περιγραφής υλικού Ι\r\n• 2013–14 και μετά: Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(30, 'Δίκτυα και επικοινωνίες υπολογιστών ΙΙ (ΤΥ)', 'Κ2', '6', 'Δίκτυα επικοινωνιών II'),
(31, 'Αρχιτεκτονική υπολογιστών ΙΙ (ΤΥ)', 'Κ2', '6', 'Είτε (1) Αρχιτεκτονική υπολογιστών ΙΙ είτε (2) μάθημα κορμού ή\r\nμάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό\r\nή επιλογής) (με σειρά προτεραιότητας μεταξύ των (1) και (2))'),
(32, 'Υπολογιστική γεωμετρία', 'ΒΚ-ΘΠ', '6', 'Υπολογιστική γεωμετρία'),
(33, 'Θεωρία πληροφορίας και κωδίκων', 'ΒΚ-ΘΠ', '6', 'Εισαγωγή στη θεωρία πληροφορίας και κωδίκων'),
(34, 'Κρυπτογραφία', 'ΒΚ-ΘΠ', '6', 'Κρυπτογραφία'),
(35, 'Συστήματα διαχείρισης δεδομένων', 'ΒΚ-ΣΛ', '6', 'Συστήματα διαχείρισης δεδομένων'),
(36, 'Τεχνολογία λογισμικού', 'ΒΚ-ΣΛ', '6', 'Τεχνολογία λογισμικού'),
(37, 'Διαχείριση πληροφορίας στο διαδίκτυο', 'ΒΚ-ΣΛ', '6', 'Είτε (1) Κατανεμημένη διαχείριση πληροφορίας ή Θέματα δια- χείρισης πληροφοριών και δεδομένων είτε (2) μάθημα κορμού\nή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής) (με σειρά προτεραιότητας μεταξύ των (1) και\n(2))'),
(38, 'Μεταγλωττιστές ΙΙ', 'ΒΚ-ΤΥ', '6', 'Είτε (1) Μεταγλωττιστές ΙΙ είτε (2) μάθημα κορμού ή μάθημα\r\nκατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής) (με σειρά προτεραιότητας μεταξύ των (1) και (2))'),
(39, 'Σχεδίαση ψηφιακών κυκλωμάτων', 'ΒΚ-ΤΥ', '6', 'Σχεδίαση ψηφιακών κυκλωμάτων και συστημάτων ή Υλοποίηση\r\nψηφιακών κυκλωμάτων και συστημάτων σε FPGA. Ειδικά για το\r\nακαδημαϊκό έτος 2013–2014, το μάθημα μπορεί να αντικατασταθεί από μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή\r\nτηλεπικοινωνιών (βασικό ή επιλογής).'),
(40, 'Εισαγωγή στα ενσωματωμένα συστήματα', 'ΒΚ-ΤΥ', '6', 'Εισαγωγή στα ενσωματωμένα συστήματα'),
(41, 'Λογική για υπολογιστές', 'ΕΠ-ΘΠ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(42, 'Παράλληλοι αλγόριθμοι', 'ΕΠ-ΘΠ', '6', 'Παράλληλοι αλγόριθμοι'),
(43, 'Προηγμένα θέματα θεωρητικής\r\nπληροφορικής', 'ΕΠ-ΘΠ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(44, 'Μαθηματική μοντελοποίηση και πολύπλοκα δίκτυα', 'ΕΠ-ΘΠ', '6', 'Μαθηματική μοντελοποίηση και πολύπλοκα δίκτυα'),
(45, 'Συνδυαστική βελτιστοποίηση', 'ΕΠ-ΘΠ', '6', 'Συνδυαστική βελτιστοποίηση'),
(46, 'Προηγμένες διεπαφές, εικονική\r\nπραγματικότητα', 'ΕΠ-ΣΛ', '6', 'Προηγμένες διεπαφές, εικονική\r\nπραγματικότητα'),
(47, 'Κατανεμημένη διαχείριση πληροφορίας', 'ΕΠ-ΣΛ', '6', 'Κατανεμημένη διαχείριση πληροφορίας'),
(48, 'Οπτικοποίηση δεδομένων και πληροφορίας', 'ΕΠ-ΣΛ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπι- κοινωνιών (βασικό ή επιλογής)'),
(49, 'Τεχνικές μηχανικής μάθησης και εξόρυξης γνώσης', 'ΕΠ-ΣΛ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπι- κοινωνιών (βασικό ή επιλογής)'),
(50, 'Ευφυή συστήματα και εφαρμογές', 'ΕΠ-ΣΛ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(51, 'Προηγμένα θέματα διαχείρισης\r\nπληροφοριών και δεδομένων', 'ΕΠ-ΣΛ', '6', 'Είτε (1) Θέματα διαχείρισης πληροφοριών και δεδομένων είτε\r\n(2) μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής) (με σειρά προτεραιότητας\r\nμεταξύ των (1) και (2))'),
(52, 'Ειδικά θέματα συστημάτων λογισμικού', 'ΕΠ-ΣΛ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπι- κοινωνιών (βασικό ή επιλογής)'),
(53, 'Αριθμητική υπολογιστών', 'ΕΠ-ΤΥ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(54, 'Ψηφιακή επεξεργασία σήματος', 'ΕΠ-ΤΥ', '6', 'Ψηφιακή επεξεργασία σήματος'),
(55, 'Κατανεμημένα συστήματα', 'ΕΠ-ΤΥ', '6', 'Προγραμματισμός κατανεμημένων συστημάτων'),
(56, 'Γλώσσες περιγραφής υλικού ΙΙ', 'ΕΠ-ΤΥ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(57, 'Σχεδίαση πρωτοκόλλων επικοινωνίας', 'ΕΠ-ΤΥ', '6', 'Σχεδίαση πρωτοκόλλων επικοινωνίας'),
(58, 'Παράλληλος προγραμματισμός', 'ΕΠ-ΤΥ', '6', 'Είτε (1) Παράλληλοι αλγόριθμοι είτε (2) Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή\r\nεπιλογής) (με σειρά προτεραιότητας μεταξύ των (1) και (2))'),
(59, 'Τεχνολογία πολυμέσων', 'ΕΠ-ΤΥ', '6', 'Είτε (1) Προηγμένες διεπαφές - Εικονική πραγματικότητα είτε\r\n(2) Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής) (με σειρά προτεραιότητας\r\nμεταξύ των (1) και (2))'),
(60, 'Σύνθεση ψηφιακών αρχιτεκτονικών', 'ΕΠ-ΤΥ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπι- κοινωνιών (βασικό ή επιλογής)'),
(61, 'Διδακτική της πληροφορικής', 'ΕΛ-Π', '5', 'Διδακτική της πληροφορικής'),
(62, 'Πληροφορική και εκπαίδευση', 'ΕΛ-Π', '5', 'Πληροφορική και εκπαίδευση'),
(63, 'Παιδαγωγικά', 'ΕΛ-Π', '5', 'Παιδαγωγικά'),
(64, 'Πληροφοριακά συστήματα διοίκησης', 'ΕΛ', '3', 'Πληροφοριακά συστήματα διοίκησης'),
(65, 'Επιχειρησιακή έρευνα', 'ΕΛ', '3', 'Επιχειρησιακή έρευνα'),
(66, 'Γνωσιακή επιστήμη', 'ΕΛ', '3', 'Γνωσιακή επιστήμη'),
(67, 'Νομική και πληροφορική', 'ΕΛ', '3', 'Νομική και πληροφορική'),
(68, 'Πρακτική άσκηση', 'ΕΛ', '3', 'Πρακτική άσκηση'),
(69, 'Εισαγωγή στην οικονομική επιστήμη', 'ΕΛ', '3', 'Εισαγωγή στην οικονομική επιστήμη'),
(70, 'Θεωρία παιγνίων', 'ΕΛ', '3', 'Θεωρία παιγνίων'),
(71, 'Αγγλική ορολογία', 'ΕΛ', '3', 'Αγγλική ορολογία'),
(72, 'Ανάπτυξη νέων προϊόντων και υπηρεσιών', 'ΕΛ', '3', 'Ανάπτυξη νέων προϊόντων και υπηρεσιών');

-- --------------------------------------------------------

--
-- Table structure for table `επιστήμης και τεχνολογίας _υπολογιστών_2012`
--

CREATE TABLE `επιστήμης και τεχνολογίας _υπολογιστών_2012` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `category` varchar(255) NOT NULL,
  `ects` varchar(255) NOT NULL,
  `correspondence` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `επιστήμης και τεχνολογίας _υπολογιστών_2012`
--

INSERT INTO `επιστήμης και τεχνολογίας _υπολογιστών_2012` (`id`, `name`, `category`, `ects`, `correspondence`) VALUES
(1, 'Εισαγωγή στην επιστήμη υπολογιστών', 'Κ', '6', 'Εισαγωγή στην πληροφορική και τις τηλεπικοινωνίες'),
(2, 'Προγραμματισμός Ι', 'Κ', '6', 'Προγραμματισμός Ι'),
(3, 'Γραμμική άλγεβρα και θεωρία αριθμών', 'Κ', '6', 'Μαθηματικά Ι'),
(4, 'Ψηφιακή σχεδίαση', 'Κ', '6', 'Λογική σχεδίαση'),
(5, 'Αγγλικά', 'Κ', '6', 'Μεθοδολογία έρευνας και συγγραφής εργασιών'),
(6, 'Οργάνωση υπολογιστικών συστημάτων', 'Κ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπι- κοινωνιών'),
(7, 'Προγραμματισμός ΙΙ', 'Κ', '6', 'Προγραμματισμός ΙΙ'),
(8, 'Διακριτά μαθηματικά', 'Κ', '6', 'Διακριτά μαθηματικά'),
(9, 'Θεωρία πιθανοτήτων και στατιστική', 'Κ', '6', 'Θεωρία πιθανοτήτων και στατιστική'),
(10, 'Επιχειρηματικότητα στην πληροφορική', 'Κ', '6', 'Επιχειρηματικότητα στην πληροφορική'),
(11, 'Αρχιτεκτονική υπολογιστών Ι', 'Κ', '6', 'Αρχιτεκτονική υπολογιστών Ι'),
(12, 'Αντικειμενοστρεφής προγραμματισμός', 'Κ', '6', 'Αντικειμενοστρεφής προγραμματισμός'),
(13, 'Δομές δεδομένων', 'Κ', '6', 'Δομές δεδομένων'),
(14, 'Μαθηματική ανάλυση', 'Κ', '6', 'Μαθηματικά ΙΙ'),
(15, 'Δίκτυα και επικοινωνίες υπολογιστών Ι', 'Κ', '6', 'Δίκτυα επικοινωνιών Ι\r\n'),
(16, 'Λειτουργικά συστήματα', 'Κ', '6', 'Λειτουργικά συστήματα'),
(17, 'Προηγμένα θέματα προγραμματισμού', 'Κ', '6', 'Προηγμένα θέματα προγραμματισμού'),
(18, 'Θεωρία υπολογισμού', 'Κ', '6', 'Υπολογισιμότητα και πολυπλοκότητα'),
(19, 'Μεταγλωττιστές Ι', 'Κ', '6', 'Μεταγλωττιστές Ι'),
(20, 'Ασφάλεια συστημάτων', 'Κ', '6', 'Ασφάλεια συστημάτων'),
(21, 'Αλγόριθμοι και πολυπλοκότητα', 'Κ', '6', 'Αλγόριθμοι και πολυπλοκότητα'),
(22, 'Βάσεις δεδομένων', 'Κ', '6', 'Βάσεις δεδομένων'),
(23, 'Προγραμματισμός συστήματος', 'Κ', '6', 'Προγραμματισμός συστήματος'),
(24, 'Διάδραση ανθρώπου-υπολογιστή', 'Κ', '6', 'Διάδραση ανθρώπου-υπολογιστή'),
(25, 'Πτυχιακή εργασία', 'Κ', '28', 'Πτυχιακή εργασία'),
(26, 'Εισαγωγή στην οικονομική επιστήμη', 'ΕΠ-ΕΟ', '4', 'Εισαγωγή στην οικονομική επιστήμη'),
(27, 'Θεωρία παιγνίων', 'ΕΠ-ΕΟ', '4', 'Θεωρία παιγνίων'),
(28, 'Αναγνώριση προτύπων και ανάλυση\r\nεικόνας', 'ΕΠ-ΕΤ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(29, 'Ψηφιακή επεξεργασία σήματος', 'ΕΠ-ΕΤ', '6', 'Ψηφιακή επεξεργασία σήματος'),
(30, 'Τεχνικές προσομοίωσης δικτύων επικοινωνιών', 'ΕΠ-ΕΤ', '6', 'Τεχνικές προσομοίωσης δικτύων επικοινωνιών'),
(31, 'Ασύρματες και κινητές επικοινωνίες', 'ΕΠ-ΕΤ', '6', 'Ασύρματες και κινητές επικοινωνίες Ι'),
(32, 'Προγραμματισμός κατανεμημένων\r\nσυστημάτων', 'ΕΠ-ΕΤ', '6', 'Προγραμματισμός κατανεμημένων\r\nσυστημάτων'),
(33, 'Σχεδίαση πρωτοκόλλων επικοινωνίας', 'ΕΠ-ΕΤ', '6', 'Σχεδίαση πρωτοκόλλων επικοινωνίας'),
(34, 'Υλοποίηση δικτυακών υποδομών\r\nκαι υπηρεσιών', 'ΕΠ-ΕΤ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(35, 'Γραφικά υπολογιστών', 'ΕΠ-ΕΥ', '6', 'Γραφικά υπολογιστών'),
(36, 'Αριθμητική ανάλυση', 'ΕΠ-ΕΥ', '6', 'Αριθμητική ανάλυση'),
(37, 'Λογική για υπολογιστές', 'ΕΠ-ΕΥ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(38, 'Τεχνητή νοημοσύνη', 'ΕΠ-ΕΥ', '6', 'Τεχνητή νοημοσύνη'),
(39, 'Δίκτυα και επικοινωνίες υπολογιστών ΙΙ', 'ΕΠ-ΕΥ', '6', 'Δίκτυα επικοινωνιών ΙΙ'),
(40, 'Σχεδίαση ψηφιακών κυκλωμάτων', 'ΕΠ-ΕΥ', '6', 'Σχεδίαση ψηφιακών κυκλωμάτων και συστημάτων'),
(41, 'Γλώσσες περιγραφής Υλικού Ι', 'ΕΠ-ΕΥ', '6', '• 2013–14 έως και 2014–15: είτε (1) Αρχιτεκτονική υπολογιστών ΙΙ είτε (2) Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής) (με σειρά προτεραιότητας μεταξύ των (1) και (2))\r\n• 2015–16 και μετά: Είτε (1) Σχεδίαση ψηφιακών κυκλωμάτων\r\nκαι συστημάτων ή Αρχιτεκτονική υπολογιστών ΙΙ είτε (2) μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής) (με σειρά προτεραιότητας μεταξύ\r\nτων (1) και (2))'),
(42, 'Θεωρία γραφημάτων', 'ΕΠ-ΕΥ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(43, 'Θεωρία πληροφορίας και κωδίκων', 'ΕΠ-ΕΥ', '6', 'Εισαγωγή στη θεωρία πληροφορίας και κωδίκων'),
(44, 'Συνδυαστική βελτιστοποίηση', 'ΕΠ-ΕΥ', '6', 'Συνδυαστική βελτιστοποίηση'),
(45, 'Ανάκτηση πληροφορίας', 'ΕΠ-ΕΥ', '6', 'Ανάκτηση πληροφορίας ή Ανάκτηση και εξόρυξη πληροφοριών'),
(46, 'Εισαγωγή στα ενσωματωμένα συστήματα', 'ΕΠ-ΕΥ', '6', 'Εισαγωγή στα ενσωματωμένα συστήματα'),
(47, 'Αρχιτεκτονική υπολογιστών ΙΙ', 'ΕΠ-ΕΥ', '6', 'Είτε (1) Αρχιτεκτονική υπολογιστών ΙΙ είτε (2) μάθημα κορμού ή\r\nμάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό\r\nή επιλογής) (με σειρά προτεραιότητας μεταξύ των (1) και (2))'),
(48, 'Υπολογιστική πολυπλοκότητα', 'ΕΠ-ΕΥ', '6', 'Υπολογισιμότητα και πολυπλοκότητα'),
(49, 'Παράλληλοι αλγόριθμοι', 'ΕΠ-ΕΥ', '6', 'Παράλληλοι αλγόριθμοι'),
(50, 'Προηγμένα θέματα θεωρητικής\r\nπληροφορικής', 'ΕΠ-ΕΥ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(51, 'Συστήματα διαχείρισης δεδομένων', 'ΕΠ-ΕΥ', '6', 'Συστήματα διαχείρισης δεδομένω'),
(52, 'Τεχνολογία λογισμικού', 'ΕΠ-ΕΥ', '6', 'Τεχνολογία λογισμικού'),
(53, 'Τεχνικές μηχανικής μάθησης και εξόρυξης γνώσης', 'ΕΠ-ΕΥ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπι- κοινωνιών (βασικό ή επιλογής)'),
(54, 'Οπτικοποίηση δεδομένων και πληροφορίας', 'ΕΠ-ΕΥ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπι- κοινωνιών (βασικό ή επιλογής)'),
(55, 'Προηγμένες διεπαφές, εικονική\r\nπραγματικότητα', 'ΕΠ-ΕΥ', '6', 'Προηγμένες διεπαφές, εικονική\r\nπραγματικότητα'),
(56, 'Κατανεμημένη διαχείριση πληροφορίας', 'ΕΠ-ΕΥ', '6', 'Κατανεμημένη διαχείριση πληροφορίας'),
(57, 'Αριθμητική υπολογιστών', 'ΕΠ-ΕΥ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(58, 'Μεταγλωττιστές ΙΙ', 'ΕΠ-ΕΥ', '6', 'Είτε (1) Μεταγλωττιστές ΙΙ είτε (2) μάθημα κορμού ή μάθημα\r\nκατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής) (με σειρά προτεραιότητας μεταξύ των (1) και (2))'),
(59, 'Γλώσσες περιγραφής υλικού ΙΙ', 'ΕΠ-ΕΥ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(60, 'Υπολογιστική γεωμετρία', 'ΕΠ-ΕΥ', '6', 'Υπολογιστική γεωμετρία'),
(61, 'Κρυπτογραφία', 'ΕΠ-ΕΥ', '6', 'Κρυπτογραφία'),
(62, 'Μαθηματική μοντελοποίηση και πολύπλοκα δίκτυα', 'ΕΠ-ΕΥ', '6', 'Μαθηματική μοντελοποίηση και πολύπλοκα δίκτυα'),
(63, 'Διαχείριση πληροφορίας στο διαδίκτυο', 'ΕΠ-ΕΥ', '6', 'Είτε (1) Ένα από: Κατανεμημένη διαχείριση πληροφορίας ή Θέ- ματα διαχείρισης πληροφοριών και δεδομένων, είτε (2) μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής) (με σειρά προτεραιότητας μεταξύ\r\nτων (1) και (2))'),
(64, 'Θέματα διαχείρισης πληροφοριών\r\nκαι δεδομένων', 'ΕΠ-ΕΥ', '6', 'Θέματα διαχείρισης πληροφοριών\r\nκαι δεδομένων'),
(65, 'Ειδικά θέματα συστημάτων λογισμικού', 'ΕΠ-ΕΥ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπι- κοινωνιών (βασικό ή επιλογής)'),
(66, 'Τεχνολογία πολυμέσων', 'ΕΠ-ΕΥ', '6', 'Είτε (1) Προηγμένες διεπαφές - Εικονική πραγματικότητα είτε\r\n(2) Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής) (με σειρά προτεραιότητας\r\nμεταξύ των (1) και (2))'),
(67, 'Ευφυή συστήματα και εφαρμογές', 'ΕΠ-ΕΥ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπικοινωνιών (βασικό ή επιλογής)'),
(68, 'Παράλληλος προγραμματισμός', 'ΕΠ-ΕΥ', '6', 'Παράλληλοι αλγόριθμοι'),
(69, 'Σύνθεση ψηφιακών αρχιτεκτονικών', 'ΕΠ-ΕΥ', '6', 'Μάθημα κορμού ή μάθημα κατεύθυνσης πληροφορικής ή τηλεπι- κοινωνιών (βασικό ή επιλογής)'),
(70, 'Παιδαγωγικά', 'ΕΛ-Π', '5', 'Παιδαγωγικά'),
(71, 'Διδακτική της πληροφορικής', 'ΕΛ-Π', '5', 'Διδακτική της πληροφορικής'),
(72, 'Ανάπτυξη νέων προϊόντων και υπηρεσιών ', 'ΕΛ', '4', 'Ανάπτυξη νέων προϊόντων και υπηρεσιών '),
(73, 'Διοίκηση έργων πληροφορικής', 'ΕΛ', '4', 'Διοίκηση έργων πληροφορικής'),
(74, 'Επιχειρηματικότητα και διοίκηση μικρομεσαίων επιχειρήσεων', 'ΕΛ', '4', 'Επιχειρηματικότητα και διοίκηση μικρομεσαίων επιχειρήσεων'),
(75, 'Νομικά θέματα πληροφορικής', 'ΕΛ', '4', 'Νομικά θέματα πληροφορικής'),
(76, 'Πρακτική άσκηση', 'ΕΛ', '4', 'Πρακτική άσκηση'),
(77, 'Γνωσιακή επιστήμη', 'ΕΛ', '4', 'Γνωσιακή επιστήμη'),
(78, 'Ανάπτυξη νέων προϊόντων και υπηρεσιών πληροφορικής', 'ΕΛ', '4', 'Ανάπτυξη νέων προϊόντων και υπηρεσιών πληροφορικής');

-- --------------------------------------------------------

--
-- Table structure for table `πληροφορική και  τηλεπικοινωνιών`
--

CREATE TABLE `πληροφορική και  τηλεπικοινωνιών` (
  `id` int(11) NOT NULL,
  `name` varchar(80) NOT NULL,
  `category` varchar(10) NOT NULL,
  `ects` varchar(10) NOT NULL,
  `correspondence` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `πληροφορική και  τηλεπικοινωνιών`
--

INSERT INTO `πληροφορική και  τηλεπικοινωνιών` (`id`, `name`, `category`, `ects`, `correspondence`) VALUES
(1, 'Εισαγωγή στην πληροφορική και τηλεπικοινωνίες', 'Κ', '6', ''),
(2, 'Λογική Σχεδίαση', 'Κ', '6', ''),
(3, 'Μαθηματικά Ι', 'Κ', '6', ''),
(4, 'Προγραμματισμός Ι', 'Κ', '6', ''),
(5, 'Φυσική', 'Κ', '6', ''),
(6, 'Αρχιτεκτονική υπολογιστών Ι', 'Κ', '6', ''),
(7, 'Διακριτά μαθηματικά', 'Κ', '6', ''),
(8, 'Μαθηματικά ΙΙ', 'Κ', '6', ''),
(9, 'Πιθανότητες και στατιστική', 'Κ', '6', ''),
(10, 'Προγραμματισμός ΙΙ', 'Κ', '6', ''),
(11, 'Αντικειμενοστρεφής προγραμματισμός', 'Κ', '6', ''),
(12, 'Δομές δεδομένων', 'Κ', '6', ''),
(13, 'Ηλεκτρομαγνητικά πεδία', 'Κ', '6', ''),
(14, 'Μαθηματικά ΙΙΙ', 'Κ', '6', ''),
(15, 'Σήματα και συστήματα', 'Κ', '6', ''),
(16, 'Αλγόριθμοι και πολυπλοκότητα', 'Κ', '6', ''),
(17, 'Αρχές τηλεπικοινωνιακών συστημάτων', 'Κ', '6', ''),
(18, 'Δίκτυα επικοινωνιών Ι', 'Κ', '6', ''),
(19, 'Ηλεκτρονική', 'Κ', '6', ''),
(20, 'Λειτουργικά συστήματα', 'Κ', '6', ''),
(21, 'Βάσεις δεδομένων', 'Κ', '6', ''),
(22, 'Πτυχιακή εργασία(1 και 2)', 'Κ', '24', ''),
(23, 'Ασφάλεια συστημάτων', 'ΒΚ-Π', '5', ''),
(24, 'Μεταγλωττιστές Ι', 'ΒΚ-Π', '5', ''),
(25, 'Διάδραση ανθρώπου υπολογιστή ', 'ΒΚ-Π', '5', ''),
(26, 'Ανάκτηση πληροφορίας', 'ΒΚ-Π', '5', ''),
(27, 'Τεχνολογία λογισμικού', 'ΒΚ-Π', '5', ''),
(28, 'Ασύρματες και κινητές επικοινωνίες Ι', 'ΒΚ-Τ', '5', ''),
(29, 'Δίκτυα επικοινωνιών ΙΙ', 'ΒΚ-Τ', '5', ''),
(30, 'Εισαγωγή στις οπτικές επικοινωνίες', 'ΒΚ-Τ', '5', ''),
(31, 'Ψηφιακές Επικοινωνίες', 'ΒΚ-Τ', '5', ''),
(32, 'Ψηφιακή επεξεργασία σήματος', 'ΒΚ-Τ', '5', ''),
(33, 'Προγραμματισμός συστήματος ', 'ΕΚ-Π', '5', ''),
(34, 'Υπολογισιμότητα και πολυπλοκότητα ', 'ΕΚ-Π', '5', ''),
(35, 'Αρχιτεκτονική υπολογιστών ΙΙ', 'ΕΚ-Π', '5', ''),
(36, 'Γραφικά υπολογιστών', 'ΕΚ-Π', '5', ''),
(37, 'Πολιτισμική Πληροφορική', 'ΕΚ-Π', '5', ''),
(38, 'Προηγμένα θέματα προγραμματισμού', 'ΕΚ-Π', '5', ''),
(39, 'Σημασιολογικός ιστός', 'ΕΚ-Π', '5', ''),
(40, 'Διαχείριση μεγάλων δεδομένων', 'ΕΚ-Π', '5', ''),
(41, 'Κατανεμημένη διαχείριση πληροφορίας', 'ΕΚ-Π', '5', ''),
(42, 'Κρυπτογραφία ', 'ΕΚ-Π', '5', ''),
(43, 'Λογική για υπολογιστές ', 'ΕΚ-Π', '5', ''),
(44, 'Μεταγλωττιστές ΙΙ', 'ΕΚ-Π', '5', ''),
(45, 'Παράλληλοι αλγόριθμοι ', 'ΕΚ-Π', '5', ''),
(46, 'Συστήματα διαχείρισης δεδομένων', 'ΕΚ-Π', '5', ''),
(47, 'Τεχνητή νοημοσύνη', 'ΕΚ-Π', '5', ''),
(48, 'Υπολογιστική γεωμετρία', 'ΕΚ-Π', '5', ''),
(49, 'Ειδικά θέματα αλγορίθμων', 'ΕΚ-Π', '5', ''),
(50, 'Θέματα διαχείρισης πληροφοριών και δεδομένων', 'ΕΚ-Π', '5', ''),
(51, 'Προηγμένες διεπαφές-εικονική πραγματικότητα', 'ΕΚ-Π', '5', ''),
(52, 'Τεχνικές μηχανικής μάθησης και εξόρυξης γνώσης', 'ΕΚ-Π', '5', ''),
(53, 'Μετρήσεις σε τηλεπικοινωνιακά συστήματα', 'ΕΚ-Τ', '5', ''),
(54, 'Ασύρματες ζεύξεις', 'ΕΚ-Τ', '5', ''),
(55, 'Δορυφορικές επικοινωνίες ', 'ΕΚ-Τ', '5', ''),
(56, 'Κεραίες', 'ΕΚ-Τ', '5', ''),
(57, 'Οπτοηλεκτρονική ', 'ΕΚ-Τ', '5', ''),
(58, 'Τηλεφωνικά δίκτυα', 'ΕΚ-Τ', '5', ''),
(59, 'Μικροκύματα και κυματοδηγούς', 'ΕΚ-Τ', '5', ''),
(60, 'Οπτικές ασύρματες επικοινωνίες', 'ΕΚ-Τ', '5', ''),
(61, 'Προηγμένα θέματα ψηφιακών επικοινωνιών', 'ΕΚ-Τ', '5', ''),
(62, 'Προσομοίωση τηλεπικοινωνιακών συστημάτων', 'ΕΚ-Τ', '5', ''),
(63, 'Συστήματα οπτικών επικοινωνιών', 'ΕΚ-Τ', '5', ''),
(64, 'Αστικά δίκτυα και δίκτυα κορμου', 'ΕΚ-Τ', '5', ''),
(65, 'Εισαγωγή στα ραντάρ', 'ΕΚ-Τ', '5', ''),
(66, 'Εφαρμογές συστημάτων και δικτύων οπτικών ινών', 'ΕΚ-Τ', '5', ''),
(67, 'Προσαρμοστική επεξεργασία σήματος ', 'ΕΚ-Τ', '5', ''),
(68, 'Στοχαστική επεξεργασία σήματος και εφαρμογές ', 'ΕΚ-Τ', '5', ''),
(69, 'Σύγχρονα κυψελωτά συστήματα επικοινωνιών', 'ΕΚ-Τ', '5', ''),
(70, 'Εισαγωγή στα ενσωματωμένα συστήματα', 'ΕΚ-ΠΤ', '5', ''),
(71, 'Αριθμητική ανάλυση', 'ΕΚ-ΠΤ', '5', ''),
(72, 'Ασύρματες και κινητές επικοινωνίες ΙΙ', 'ΕΚ-ΠΤ', '5', ''),
(73, 'Επεξεργασία εικόνας: αρχές, αλγόριθμοι και εφαρμογές', 'ΕΚ-ΠΤ', '5', ''),
(74, 'Θεωρία πληροφορίας και κωδικών', 'ΕΚ-ΠΤ', '5', ''),
(75, 'Συστήματα λήψης αποφάσεων', 'ΕΚ-ΠΤ', '5', ''),
(76, 'Σχεδίαση εφαρμογών και υπηρεσιών διαδικτύου', 'ΕΚ-ΠΤ', '5', ''),
(77, 'Επεξεργασία σημάτων πολυμέσων', 'ΕΚ-ΠΤ', '5', ''),
(78, 'Θεωρία και εφαρμογές στην επεξεργασία ομιλίας ', 'ΕΚ-ΠΤ', '5', ''),
(79, 'Μαθηματική μοντελοποίηση και πολύπλοκα δίκτυα ', 'ΕΚ-ΠΤ', '5', ''),
(80, 'Πληροφοριακά συστήματα διοίκησης ', 'ΕΚ-ΠΤ', '5', ''),
(81, 'Στοχαστικά μοντέλα δικτύων και ανάλυση απόδοσης', 'ΕΚ-ΠΤ', '5', ''),
(82, 'Σχεδίαση ψηφιακών κυκλωμάτων και συστημάτων', 'ΕΚ-ΠΤ', '5', ''),
(83, 'Υλοποίηση ψηφιακών κυκλωμάτων και συστημάτων σε FPGA', 'ΕΚ-ΠΤ', '5', ''),
(84, 'Αρχιτεκτονική μεταγωγέων και δρομολογητών', 'ΕΚ-ΠΤ', '5', ''),
(85, 'Δίκτυα αισθητήρων', 'ΕΚ-ΠΤ', '5', ''),
(86, 'Ομαδική εργασία σε έργα πληροφορικής και τηλεπικοινωνιών', 'ΕΚ-ΠΤ', '5', ''),
(87, 'Προγραμματισμός κατανεμημένων συστημάτων', 'ΕΚ-ΠΤ', '5', ''),
(88, 'Προχωρημένα θέματα θεωρίας κωδίκων', 'ΕΚ-ΠΤ', '5', ''),
(89, 'Συνδυαστική βελτιστοποίηση', 'ΕΚ-ΠΤ', '5', ''),
(90, 'Σχεδίαση πρωτοκόλλων επικοινωνίας', 'ΕΚ-ΠΤ', '5', ''),
(91, 'Τεχνικές προσομοίωσης δικτύων επικοινωνιών', 'ΕΚ-ΠΤ', '5', ''),
(92, 'Ξένη γλώσσα ', 'ΕΕ', '3', ''),
(93, 'Εισαγωγή στην οικονομική επιστήμη', 'ΕΕ', '4', ''),
(94, 'Πρακτική άσκηση', 'ΕΕ', '3', ''),
(95, 'Θεωρία παιγνίων', 'ΕΕ', '4', ''),
(96, 'Μεθοδολογία έρευνας και συγγραφής εργασιών', 'ΕΕ', '3', ''),
(97, 'Πρακτική άσκηση Erasmus', 'ΕΕ', '6', ''),
(98, 'Νομικά θέματα πληροφορικής και τηλεπικοινωνιών', 'ΕΕ', '3', ''),
(99, 'Επιχειρηματικότητα στην πληροφορική', 'ΕΕ', '3', ''),
(100, 'Μέθοδοι ανάπτυξης και αξιολόγησης εκπαιδευτικού περιεχομένου ', 'ΠΔ', '3', ''),
(101, 'Παιδαγωγικά θέματα ΤΠΕ στην εκπαίδευση ', 'ΠΔ', '3', ''),
(102, 'Παιδαγωγικά και ψυχολογικά στην εκπαίδευση', 'ΠΔ', '3', ''),
(103, 'Πρακτική άσκηση για παιδαγωγικά και διδακτική εμπειρία', 'ΠΔ', '2', ''),
(104, 'Γνωστική ψυχολογία και εκπαιδευτική πράξη', 'ΠΔ', '3', ''),
(105, 'Διδακτική της πληροφορικής', 'ΠΔ', '2', ''),
(108, 'test22', 'Κ', '622', '1231234567'),
(113, 'test5', 'Κ ', 'test5', 'test5');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2009`
--
ALTER TABLE `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2009`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2009_2010`
--
ALTER TABLE `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2009_2010`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2011`
--
ALTER TABLE `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2011`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2012`
--
ALTER TABLE `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2012`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `επιστήμης και τεχνολογίας _υπολογιστών_2002_2003`
--
ALTER TABLE `επιστήμης και τεχνολογίας _υπολογιστών_2002_2003`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `επιστήμης και τεχνολογίας _υπολογιστών_2004__2005__2006`
--
ALTER TABLE `επιστήμης και τεχνολογίας _υπολογιστών_2004__2005__2006`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `επιστήμης και τεχνολογίας _υπολογιστών_2007_2011`
--
ALTER TABLE `επιστήμης και τεχνολογίας _υπολογιστών_2007_2011`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `επιστήμης και τεχνολογίας _υπολογιστών_2012`
--
ALTER TABLE `επιστήμης και τεχνολογίας _υπολογιστών_2012`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `πληροφορική και  τηλεπικοινωνιών`
--
ALTER TABLE `πληροφορική και  τηλεπικοινωνιών`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2009`
--
ALTER TABLE `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2009`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=87;

--
-- AUTO_INCREMENT for table `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2009_2010`
--
ALTER TABLE `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2009_2010`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=219;

--
-- AUTO_INCREMENT for table `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2011`
--
ALTER TABLE `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2011`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=84;

--
-- AUTO_INCREMENT for table `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2012`
--
ALTER TABLE `επιστήμης και τεχνολογίας _τηλεπικοινωνιών_2012`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=88;

--
-- AUTO_INCREMENT for table `επιστήμης και τεχνολογίας _υπολογιστών_2002_2003`
--
ALTER TABLE `επιστήμης και τεχνολογίας _υπολογιστών_2002_2003`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=103;

--
-- AUTO_INCREMENT for table `επιστήμης και τεχνολογίας _υπολογιστών_2004__2005__2006`
--
ALTER TABLE `επιστήμης και τεχνολογίας _υπολογιστών_2004__2005__2006`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=87;

--
-- AUTO_INCREMENT for table `επιστήμης και τεχνολογίας _υπολογιστών_2007_2011`
--
ALTER TABLE `επιστήμης και τεχνολογίας _υπολογιστών_2007_2011`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=73;

--
-- AUTO_INCREMENT for table `επιστήμης και τεχνολογίας _υπολογιστών_2012`
--
ALTER TABLE `επιστήμης και τεχνολογίας _υπολογιστών_2012`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=79;

--
-- AUTO_INCREMENT for table `πληροφορική και  τηλεπικοινωνιών`
--
ALTER TABLE `πληροφορική και  τηλεπικοινωνιών`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=114;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
